{"model":{"name":"model_1","layers":[{"name":"x_100","class_name":"InputLayer","config":{"batch_input_shape":[null,100,617],"dtype":"float32","sparse":false,"name":"x_100"},"inbound_nodes":[]},{"name":"x_40","class_name":"InputLayer","config":{"batch_input_shape":[null,100,617],"dtype":"float32","sparse":false,"name":"x_40"},"inbound_nodes":[]},{"name":"x_raw","class_name":"InputLayer","config":{"batch_input_shape":[null,100,617],"dtype":"float32","sparse":false,"name":"x_raw"},"inbound_nodes":[]},{"name":"lstm_1","class_name":"LSTM","config":{"name":"lstm_1","trainable":true,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"units":32,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1.0,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.0,"recurrent_dropout":0.0,"implementation":1},"inbound_nodes":[[["x_100",0,0,{}]]]},{"name":"lstm_2","class_name":"LSTM","config":{"name":"lstm_2","trainable":true,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"units":32,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1.0,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.0,"recurrent_dropout":0.0,"implementation":1},"inbound_nodes":[[["x_40",0,0,{}]]]},{"name":"lstm_3","class_name":"LSTM","config":{"name":"lstm_3","trainable":true,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"units":32,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1.0,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.0,"recurrent_dropout":0.0,"implementation":1},"inbound_nodes":[[["x_raw",0,0,{}]]]},{"name":"concatenate_1","class_name":"Concatenate","config":{"name":"concatenate_1","trainable":true,"axis":-1},"inbound_nodes":[[["lstm_1",0,0,{}],["lstm_2",0,0,{}],["lstm_3",0,0,{}]]]},{"name":"dense_1","class_name":"Dense","config":{"name":"dense_1","trainable":true,"units":64,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["concatenate_1",0,0,{}]]]},{"name":"dense_2","class_name":"Dense","config":{"name":"dense_2","trainable":true,"units":32,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["dense_1",0,0,{}]]]},{"name":"dense_3","class_name":"Dense","config":{"name":"dense_3","trainable":true,"units":16,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["dense_2",0,0,{}]]]},{"name":"dense_4","class_name":"Dense","config":{"name":"dense_4","trainable":true,"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["dense_3",0,0,{}]]]}],"input_layers":[["x_100",0,0],["x_40",0,0],["x_raw",0,0]],"output_layers":[["dense_4",0,0]]},"weights":[[[-0.0779045001,0.0716660321,-0.0374387316,0.0307764374,0.0405180454,0.0240426157,-0.0805914402,-0.0084207645,-0.0220581889,0.0111884037,-0.0868191347,0.0201134775,-0.0830285847,0.0337226577,0.0760258287,-0.068017818,0.0668740124,-0.0468646586,0.083462894,0.0806304514,-0.0386460982,0.0064809169,0.0183340367,-0.0166421514,-0.0245654751,0.0011428581,0.0158661343,-0.0856913105,-0.057366129,-0.0582257286,-0.0605887733,-0.000439928,-0.0762781352,0.011745791,0.026296718,-0.0940241516,-0.0896528736,-0.0294041205,-0.0469154343,-0.0448091477,-0.0852563083,0.089050442,0.0524578989,-0.0795746297,0.0286533311,0.015168068,0.003629531,0.0291083083,-0.0738650262,-0.0739074573,-0.0336449668,0.0338861272,0.0477023534,-0.0130740767,-0.0309292804,0.0554974601,-0.0384357087,-0.046567481,-0.0622896813,-0.0624125339,-0.0831631944,-0.0008642885,-0.098891221,-0.042982284,0.0743553787,0.0096941674,-0.0296449922,-0.0421035364,0.030426668,0.0522993803,0.0470471606,0.0749713182,-0.0940845087,-0.0341712348,0.0822195709,0.0653733537,0.0817991793,0.0483596437,0.0789363682,0.0595412552,-0.0474709421,0.0137175201,-0.0696633458,-0.0105032697,-0.0735362917,-0.0343520679,0.0344141014,-0.086402677,-0.0507724024,-0.0461440049,-0.0042617763,0.0029217619,-0.0718363002,-0.0809704959,-0.0552859753,-0.0776724219,-0.0545676649,0.0002144915,-0.0203844141,-0.0526974127,-0.050077565,0.0054576281,-0.0539403558,0.0905642956,0.0494359359,-0.0358240344,-0.0309967883,-0.0173619278,0.059607923,-0.0056373645,-0.0599813573,-0.004539019,0.0419973396,-0.0565731116,-0.040821407,0.0464018025,0.058156196,-0.0273538418,0.0230183695,0.0694122389,-0.0456775799,-0.0805523694,-0.0305898245,-0.0772885978,0.0157818682,0.0206535812,-0.0080503169,-0.0287502706],[-0.0352485068,0.0687634349,-0.0734784529,-0.0202442221,0.0443520471,0.0567044802,0.0151949869,0.0622129664,0.0782315433,-0.0022230351,0.0688014552,-0.0670001656,-0.0251852442,0.0290904325,-0.0326253362,0.0229731277,-0.0676266104,0.0618208311,0.0202573501,-0.0631115064,0.0836414695,-0.0847217739,-0.0487739369,-0.0809372365,0.0571903177,0.0017474625,0.0822857842,-0.0164853912,-0.080909647,-0.0420340337,0.0433884263,-0.0798194483,-0.017578315,0.0501058437,-0.0477824695,0.0188080166,0.0481217951,-0.0587891862,-0.0833710283,0.0478443764,0.0300918669,0.0610102005,-0.0241171494,-0.0890767127,-0.0316833928,0.040484339,0.072334677,0.0580338724,-0.0560677014,0.0184417963,0.0543963313,0.0671100691,0.0041540279,-0.094023779,-0.029205624,0.0248332787,0.0604246072,0.0488107577,0.0499531403,-0.046825733,0.0629722252,-0.0118715437,0.0420122035,0.0099640256,-0.0261386707,0.0721795484,0.0282515455,-0.0099174911,0.0758515075,0.0914426371,-0.0209876131,-0.0371421501,0.0647068769,0.0807895437,-0.0255297758,-0.0425361805,0.0756381154,0.0537502915,-0.0637661219,-0.0295145418,-0.0787746981,-0.0445470847,-0.0189604629,-0.0561649874,0.0576306283,0.0472804457,0.0594564117,-0.0096927313,0.0325855799,-0.044004757,0.009218039,-0.0438531637,0.0490038805,-0.0275859516,0.0892948881,-0.0584495738,-0.0517976545,-0.0827677026,-0.0162104703,-0.0742286816,0.0742849037,-0.0203423817,0.0102898087,0.0223634541,0.0631481782,0.0481890813,0.0538721904,0.0605967306,0.0225007087,0.0740613416,-0.019545475,-0.0641898066,0.0479801781,-0.0418710783,0.0793918222,0.0149193807,-0.0588220991,-0.0115783606,-0.0463213697,0.050211139,-0.0130651863,-0.0273024496,0.066283308,0.0200745258,0.078486979,-0.0417002514,-0.0436691493,0.0341365226],[-0.0192786232,-0.0148941055,-0.0784225687,-0.0548493564,-0.0759127811,0.0289438479,-0.0258225221,-0.0389696769,0.0110156909,-0.0370927155,0.0199704282,-0.0120325126,0.0540428571,0.0880912095,0.0362156965,0.060523089,0.0677041039,0.0749974474,-0.0086715063,-0.0128924483,0.075786069,0.0380052179,0.0462878793,0.0135499127,0.0006674454,0.0479677618,0.0912556723,0.0577316917,0.0275085215,-0.0407367647,0.0662128702,-0.0712802261,-0.0314004719,0.0241565052,0.0753971264,-0.0972456709,-0.0591129288,0.0610370822,0.0569268391,0.0438160859,0.046449814,0.0081183566,-0.0394272208,0.0532680415,-0.0142337224,-0.0339765809,0.0230306443,-0.0413772091,0.0749079138,0.0076736161,0.0925921574,0.0261894688,-0.0723934099,0.06077604,0.0281612352,-0.0130219562,0.0469485112,-0.0590552166,-0.0640461743,0.0636573285,-0.0569554493,-0.0043037599,0.0043287841,-0.0687843338,-0.0651310757,0.0021403665,-0.0297342706,0.0111665353,-0.0566402823,-0.0164146218,0.0042939745,-0.0807878673,0.0352363773,-0.0461029299,0.0693876147,-0.0536257215,0.0000815012,-0.0468646772,-0.0056765252,0.0995326936,0.0351092257,-0.0016290443,0.0150220925,-0.0357680283,-0.0073833237,0.0575216562,-0.0826633871,-0.0036974165,-0.0748273134,0.0617858507,-0.0268040933,0.0510117561,0.0330795608,0.0415585898,-0.047965657,0.0438028723,0.0637323409,0.0776159838,-0.014571961,0.0371108949,0.021686133,-0.002852805,-0.0077101216,-0.0449693166,-0.0260111,-0.0570479669,0.0066749444,-0.0175386611,-0.0396056101,-0.0460041203,-0.0886799768,0.054567121,-0.0959405378,0.0746745467,-0.0460406877,0.0725147948,0.0075699235,0.0763804466,-0.0300864931,0.07274165,-0.0737970695,-0.0319314711,-0.0634328946,-0.0456545912,0.029370483,0.0724660605,-0.0552739799,-0.0432694852],[0.076719299,0.0610360876,0.0339109339,-0.0392658971,0.01149657,0.0487290025,0.0427609123,0.0759557262,0.0593665652,-0.0119589232,0.0751111805,0.0517877974,-0.0743894801,-0.0723058209,-0.0182796381,0.0776165873,0.0638960004,0.0897458419,0.0239622463,-0.0043355487,-0.0690357983,-0.0237938277,0.0530430675,0.0051799752,-0.0234024357,0.060249038,-0.0618288107,-0.044019714,-0.0267780852,0.0623445101,-0.0218968466,-0.0724925771,-0.043636281,0.0586393066,0.0414173193,0.0710506961,0.0038360222,0.0154887764,-0.000682716,0.0869229734,-0.0252999496,0.0118233291,0.0091053825,-0.0510358177,-0.0374624468,0.0770938098,0.0744560286,0.0081964992,-0.0551718622,-0.038420707,0.0249954909,0.0823733211,-0.035307467,0.0810637698,-0.06488657,-0.0082094045,-0.0937041268,0.041381795,0.0313358121,0.050580062,-0.0318245478,-0.0827837065,0.0411473289,-0.0102598174,-0.0793845505,-0.0843640491,0.0691550076,-0.0230376851,-0.0348305516,0.0899658278,0.0316981934,-0.0624464862,0.0236476436,0.038428355,0.0480306596,-0.0626892522,-0.0195093937,0.0459745936,0.0813565105,0.0198263433,0.0430380926,0.0724827871,-0.0599380918,0.0614778623,0.0669965222,-0.0740523189,-0.0024496601,-0.0307627134,0.0910248086,0.0571205318,0.0429764204,-0.0797675177,0.0690030456,0.0864256471,-0.022487551,0.030171765,-0.0769726858,-0.0935533866,0.0217186958,-0.0784028023,-0.016621938,-0.064193286,0.0616835393,0.0696770102,-0.0071260375,-0.0114931939,-0.0947628468,0.0723210871,-0.0405503996,0.0410613045,-0.0145855714,0.028337393,0.0125426445,0.0081448611,-0.017328525,-0.0645670891,0.0906101316,0.0166475046,-0.0167832263,0.0308508929,-0.0288267713,-0.0756424218,-0.0179691091,-0.0140841175,-0.0191156957,-0.0723579898,0.0120470589,0.0738769248],[0.0337529853,0.0069418508,-0.0295724962,-0.0952568054,-0.0077132205,-0.0728741139,0.0724819452,-0.0545943156,0.016973557,0.0657405406,0.0662003309,-0.0318049602,0.0924516767,-0.0473190062,0.0501440614,-0.0128377983,-0.061067123,-0.037818227,-0.0454733521,-0.0623913333,0.0257658157,-0.0905476585,-0.0700305179,0.0953566879,-0.0855613351,-0.0781112909,0.0925557017,-0.0857823119,-0.0758535266,-0.0662971586,-0.0563080385,0.0020241404,0.0109035773,0.0327483192,0.0666716769,-0.0922858119,0.0276610497,0.0782079995,0.0274705812,0.0854324549,-0.0352888927,-0.0260462258,0.0712616444,-0.0702267885,0.0022021695,0.0905035436,0.0019635204,-0.0603817813,-0.0546750985,0.0639942884,-0.0137990825,0.0108659081,0.0582152903,0.014352628,-0.0102875093,-0.0329774395,-0.0469949208,-0.0529851429,0.0844427496,-0.0395509563,0.0683434978,-0.0393828414,-0.010164558,-0.0407343395,0.0768832192,0.0214682687,0.0742096454,-0.0911807716,-0.0829826817,0.0660940632,0.0527919456,0.0137539525,0.0446927361,0.0545415431,0.0518353693,-0.0391793586,-0.0297585633,-0.080754824,-0.029259393,-0.0559026748,0.0217263028,0.0386733972,0.0687694773,0.0724041238,-0.0145126637,0.0440737158,0.0002262214,0.0410622656,-0.0695542246,0.0177189875,0.0251671299,0.0722065195,0.0731734037,-0.0122220153,0.0471746176,0.0343962349,0.0734108835,-0.0392084718,-0.0053477138,0.0430962779,0.0839642286,-0.0026116865,0.0468186066,-0.0624028668,0.0724884421,0.0403559282,-0.0291255023,0.0424164049,0.0589892454,-0.0998828486,-0.0179741625,-0.0745541677,-0.024991544,-0.0123886727,-0.0536328554,0.0581977703,0.0286443532,-0.0946962386,-0.0127669787,-0.0485693775,-0.0651116669,-0.0203105863,0.0298747011,-0.0760711282,0.0638521388,-0.0195644032,0.0590707771,0.079817377],[0.0608744845,-0.0139993196,-0.0002304024,-0.0692139417,0.0251092054,0.0254480168,0.0781454071,0.0091574779,-0.0280063413,-0.0465524793,0.0612407625,-0.0277420878,-0.0134821655,0.0155591816,-0.0699918866,-0.0183881,0.0172831081,-0.016009884,0.0311347526,-0.0078180311,-0.0489618555,-0.0505323038,-0.0657562092,-0.0376264937,-0.0910660177,0.0034993403,0.0750088617,0.0247758124,-0.0223370064,-0.0483280383,0.0359557867,0.0272897016,0.0002770989,-0.0029042095,-0.0382635109,-0.019666547,0.0799105689,-0.0871041268,-0.00505176,-0.0775058642,0.0748133659,-0.0776063949,-0.0199546684,0.0034691552,-0.0578478724,0.0015091784,0.0590830259,0.0218693446,-0.0122538982,-0.0551774763,0.008149026,-0.0504026972,0.0041615595,-0.0550000183,-0.0035149415,-0.0726451278,-0.0371307135,-0.0267462917,-0.0080596535,0.0340206847,-0.0084460909,0.0660160407,-0.0364676602,0.0231050532,0.0179186445,-0.0650638714,0.0685377494,-0.0426931567,0.0319183059,-0.0434583426,0.0486228056,-0.0158934537,0.0164879393,0.0320753418,-0.0411206968,-0.0804264024,0.0677429661,-0.0474795774,-0.0835657194,-0.0660951585,0.0068535134,-0.0605368018,0.0768730491,-0.0758079067,0.0315553173,0.0650061592,0.0322445519,0.0708201826,-0.0771840736,-0.0313583985,-0.0020505176,-0.0298839528,0.0190984644,0.0208747275,0.023419356,-0.0436039343,0.0425144956,0.0730028674,0.0328230485,0.0474507473,-0.0377612934,0.0225897972,0.0701834485,-0.0879237652,-0.0759413093,0.0309208203,0.0564957559,-0.0473207869,-0.09047506,-0.0272660982,0.0287973639,0.0483896472,-0.0537216701,0.0112613607,0.0378592163,0.053404443,0.0757689103,-0.0300889239,0.0014105389,-0.0482473746,0.0132372193,-0.0043518138,-0.1001041755,0.0585584342,-0.050183028,-0.0403964631,-0.1036774591,0.0156463366],[-0.028755134,0.0088345148,0.0247831624,-0.0377161391,-0.0771538541,-0.0850257874,-0.0156767368,0.017051274,-0.0005451308,0.0540196337,-0.0315718278,-0.02451423,0.079036504,-0.0159048364,0.0037195664,-0.096968472,0.0495083183,0.0730793178,-0.0551045612,0.0750376657,-0.0377320424,-0.010524516,-0.0829276964,-0.0754396766,-0.0614916272,0.0248407889,-0.0156843495,0.060757909,0.0199023373,0.0393249951,0.0610336587,-0.0299141109,0.05572946,-0.0157359727,0.0378801078,-0.0029000854,0.0624723062,-0.0488077924,-0.0383924358,-0.0575665161,-0.0491857789,-0.0357118212,-0.0161502641,0.0219721049,-0.0027980979,-0.0154079366,-0.0399129465,-0.0912710428,0.0513150953,-0.0658213869,0.0185620431,0.0823765099,0.0067780102,0.055759985,-0.0193393622,-0.0146010723,-0.0242362581,-0.0907415599,-0.0184859671,-0.0743902698,0.0295656808,-0.0840877593,0.0706875175,-0.0947491527,-0.0697043687,0.0597394295,-0.0349186957,-0.046551954,-0.0527000837,0.0842691809,-0.0649451241,-0.0465459079,0.0611319989,0.0366407111,-0.0033153573,-0.0838117823,-0.0129082818,0.0012748692,0.0359492637,0.059484154,-0.0242825821,0.0233018696,0.0104252268,0.0027846773,-0.0145570887,0.0435220264,0.0043880153,-0.0096717682,0.0662528872,0.0372241363,-0.0084726103,0.043710988,0.0315607972,0.0359073766,-0.0173278749,-0.0666289181,-0.0908442363,0.0453164428,0.0033558169,-0.0161658525,-0.031084748,-0.0205893572,-0.0201061107,-0.0588134713,0.0216968581,-0.01060839,-0.0499513298,0.0601789579,0.0056262328,0.0562888123,-0.0962724909,0.0479893833,-0.0530491062,0.0217446741,0.0706062019,-0.0981147513,0.0591540076,0.0781292841,-0.0430603139,0.0801854506,-0.0946788266,0.0192204677,-0.0385475606,-0.0517528504,0.0624635108,0.0617166311,0.0239912551,-0.0561481975],[-0.032573957,-0.0486851111,0.027543636,0.0435425192,0.0171374511,-0.0262788236,-0.0292254165,-0.0691997334,-0.0765593648,0.0737899393,0.0582101829,-0.0108978385,0.019719081,-0.066145964,-0.031656757,-0.038819693,-0.0490526296,-0.0212916862,-0.0019572254,-0.0004338415,0.0678019673,-0.0127792256,-0.007106151,0.0213542636,-0.0806701407,0.0614508763,-0.0418388583,0.0031185648,-0.0883635804,0.0135813663,0.0874621347,0.0036327441,0.0146448789,-0.0451032855,-0.0895389616,0.0484968871,-0.0247709621,0.0668883547,-0.0916532055,-0.0776861385,0.0010634584,0.0564713255,0.0835123137,-0.0415326133,-0.0783718079,-0.0684670135,-0.0086277192,-0.0937587768,-0.0039932518,-0.0648793057,0.0409697257,0.0246021003,-0.0020031659,0.016311707,-0.0585033782,-0.0414160639,-0.0088174669,-0.0307924822,-0.0077001639,-0.0080935312,-0.0035050057,-0.0895515233,-0.0398207791,0.0595990121,-0.0541794151,0.0170155223,0.0495863184,0.0506448783,-0.0223105252,-0.0260222275,0.009939421,0.0755099207,-0.0674801171,0.0311770849,-0.0728775635,-0.0246784035,0.0707357898,0.0788308904,0.0458519198,0.0531716794,-0.0879557058,-0.0134375645,-0.0833356902,0.0731876791,0.0492218733,0.0408521965,-0.0478209853,-0.0677559525,-0.0364443548,0.0066487943,-0.0606810227,0.0853908882,0.0095965536,0.0110463295,-0.026260823,0.0006619524,0.080210574,-0.0486669652,0.0343337134,-0.0605991445,-0.0121280178,-0.0066889198,-0.079255566,-0.0050064311,-0.0862205103,0.0788575485,0.0313000903,0.0034693419,0.079281345,-0.0991580337,-0.0251144767,-0.0151673276,-0.0129769044,0.0027102171,0.0810524747,-0.0007286722,-0.0777856782,0.0317148082,0.076778613,0.0304728411,0.0067170588,0.0207040794,0.004525471,-0.0140371723,0.0634030998,-0.003126286,0.0444749072,0.0764442012],[0.0280206967,-0.0512108691,0.0231895819,-0.071598351,-0.0292360075,0.0681207031,0.0409614071,0.0263986941,0.0088066999,0.046541933,-0.0588556454,-0.0192385167,0.0586905368,-0.0045173028,-0.0368802212,-0.0183206871,-0.023046935,-0.0413961224,-0.0142695373,-0.0009161327,0.0029811014,-0.0191813223,-0.0900658295,-0.0069807251,-0.0844036937,0.0054658032,0.0678034201,0.0020341056,-0.0732975826,0.0628118813,0.0319374874,-0.0118014663,0.016130114,0.0281518456,-0.0803724825,0.0410273746,-0.0872364193,-0.0670080706,-0.0568001643,-0.0344167762,0.0290595908,-0.0425430648,0.0308246017,-0.0186990425,0.0510625876,0.0230872482,0.0359567069,0.0599928163,0.0793607384,0.0312641636,-0.0385591201,-0.0857035294,0.0328722894,-0.0445140079,0.0166235324,0.0198222529,-0.0204851944,0.0174596235,-0.0057398998,0.0152494153,-0.0118439374,-0.0363267288,-0.0806425959,0.0158312414,-0.0743179992,0.0601725131,0.0214043334,-0.0195260979,-0.0728593171,-0.0398118421,-0.019603489,0.0410154164,-0.0761367828,-0.0271817353,-0.0921768993,-0.0494617485,0.0543519333,-0.0941270515,0.0843854919,0.0870140791,-0.0515779518,0.0099456413,0.0795425326,0.0782763362,0.0796843022,0.067369774,0.0165178962,-0.0462710112,0.0877543688,-0.0683505982,-0.0325676203,-0.0724849254,0.0383757316,-0.0445088036,-0.0765223429,0.085482426,0.0643540919,-0.0683803484,-0.0404398739,-0.0452858619,-0.0769068375,-0.0312456042,0.0420275256,-0.0830224603,-0.0929841325,-0.0742832348,-0.0632810146,0.0011158824,0.0141870724,0.0325186066,-0.0093305111,0.0134840477,0.0059320806,-0.045841068,-0.0283268951,0.0091607179,-0.0359618515,0.0542595759,-0.0918343067,0.051112067,0.0166011471,0.0289559606,0.026231695,-0.0269638877,-0.0238199197,-0.0284969993,-0.0951603875,-0.0171338506],[0.0802075416,0.0241079107,0.0073818699,-0.0492334701,0.0810624212,-0.0845558047,0.0340786353,0.0649288595,-0.0412165895,-0.01058752,-0.0784812644,0.004492342,0.0627900809,-0.0505360551,-0.0717867836,0.015481892,-0.0854262039,-0.0213754196,-0.055266235,0.0841641426,0.0220623855,-0.0585719906,-0.0574061908,-0.0499763675,-0.0400430188,-0.055787757,-0.0755667388,0.0413189828,-0.0640234873,0.002212004,0.0644937083,-0.0543143526,-0.0156519599,-0.0921786278,-0.0767061859,0.0382773168,0.0678199306,-0.0814087018,-0.0341031067,-0.0084315538,-0.0749660134,0.0240154676,0.0280486979,-0.0136087807,0.0392310396,0.0760485232,0.0471929722,-0.0254558288,-0.038934242,-0.0020909498,0.0608605333,0.0472623631,0.0776278973,0.0629722625,0.0716731921,-0.0169187468,-0.0133790178,-0.0229047183,0.0502904654,0.0009716301,0.0504401177,-0.0945889726,-0.0338277295,0.08256495,0.0613578707,0.0898367241,0.008782289,-0.0803331435,-0.0379093513,0.0610326678,0.0781520829,0.0734863281,0.017608827,-0.0019687312,-0.0197398756,-0.029760832,0.0318367817,0.0301292203,0.0411887839,0.0118346801,0.0737345666,0.023710018,0.0150786554,-0.0257804133,-0.0160580464,-0.0849219784,0.06960053,-0.0250609629,-0.0480039455,0.0137086045,-0.0658116043,0.0265323091,0.0152850123,-0.0450359173,0.0496207215,0.006051857,-0.0926935226,0.0561312251,-0.0241724178,-0.0533401929,0.0501949787,-0.0803604424,-0.0484918207,-0.0900836885,0.0098085422,-0.0133626191,-0.075372465,0.0258682892,0.0067617144,-0.0601166449,0.0102487672,-0.0228495747,0.01957573,0.0480969548,-0.0589663684,-0.0722281933,0.0829398185,0.0285779946,0.0499957576,0.0490669683,-0.0797504708,-0.0235441979,-0.0502175912,-0.0797434673,0.0708185956,-0.0344891697,0.0569018722,0.019458577],[-0.0552521087,-0.0792439878,0.0504345708,-0.0020278902,0.0671854019,0.0142560657,-0.0903537571,0.0474946089,-0.0484438948,-0.072898902,0.0443288311,0.0552090369,-0.0273003522,0.0467196293,0.0583603196,-0.06191447,-0.0336256512,-0.0794730932,0.0870868042,-0.0042388099,-0.042062711,-0.0819293037,-0.0021739244,0.049834352,-0.0352146551,-0.0656913295,-0.0032954332,-0.0100468583,-0.064483501,0.0788596123,0.0759702772,-0.0031216731,0.0196502171,-0.0026798919,-0.0076713529,-0.0498718657,-0.0344199613,0.0049281446,-0.0523365475,-0.052781526,0.0241419654,0.061526712,0.0298364181,-0.0128384391,0.0155861462,0.0566318333,0.0084200231,-0.0038047079,0.0390614234,-0.0186061766,-0.0539027601,-0.0607351661,-0.0610622242,0.0642934591,-0.0431368724,-0.03280624,0.0583114922,-0.0116179343,0.0446248017,0.0591501743,0.0077177114,-0.0674875379,-0.0022836099,0.0253913961,-0.0233949386,0.0737508759,-0.0146087669,-0.0004172125,0.0253562815,0.0937872827,0.0097720278,-0.0666123629,0.0677719787,-0.0458326526,0.0480277017,-0.0712749287,0.0546456277,0.0269189272,0.0077808374,0.0526611321,0.0364875831,0.0540812947,-0.0227881595,0.0213685092,-0.0593593493,0.0017233801,0.0835497007,0.0525830202,-0.0036013091,0.0720788464,0.0140283993,0.0661368072,0.0371793769,0.0817163587,-0.048288282,0.0443363152,0.0779504329,-0.0887162313,0.0481861681,0.0378618874,-0.0134664625,-0.0820399299,0.0474014021,0.0381116159,-0.0720908418,-0.0924652666,-0.0877594128,0.0357184149,-0.0660081357,-0.0365008488,0.0790652931,-0.0647182018,-0.0668363869,0.0017609104,-0.0863492414,-0.0695093572,0.0844357908,0.0053380979,-0.0685027465,-0.0144261867,0.0248628277,0.0358821154,-0.0353854485,0.0142559903,0.0726365373,-0.0628613979,0.0131997382,0.0779047459],[0.0663595796,-0.0932016075,-0.0519556366,-0.0586698949,-0.0479019284,0.0603626929,0.0259421803,0.0227474198,0.0201108567,0.0568471439,0.0633586124,-0.0817490518,0.0660031885,-0.013851501,-0.0125066731,-0.0357460007,0.016248554,0.0910240337,-0.0417742804,0.0893029794,-0.0070900745,0.0546438843,-0.0252559334,0.0487138443,-0.0387941562,0.0431947224,0.0681521371,-0.0668740422,0.0329989009,-0.0529309511,-0.0140948603,0.0580149479,-0.0525502115,0.0003538225,0.0006224853,0.0340164118,0.0089347558,-0.0061792401,0.0229628887,0.0472902171,0.0195858236,0.0268638767,-0.0517189428,-0.0814246908,-0.0530177467,-0.0542572513,0.0450064652,-0.0188446194,-0.0681614131,0.0352900028,0.0881095752,0.0817133188,0.0795860589,-0.0836190283,-0.0308904666,-0.0539627858,-0.0302340481,0.0159010347,0.0654638559,0.0450206436,-0.0477537103,0.0720633194,0.0445831567,-0.0435526296,-0.0273201689,0.0230538677,0.0040138904,0.0302679222,-0.0138377342,-0.0015398782,-0.0449016616,-0.0036419458,-0.0127967028,0.0404375456,-0.0059751538,-0.0847511888,0.0243149493,0.0755305737,-0.0574058741,-0.0360007845,-0.0428103805,-0.0236021765,0.0010638547,-0.060263522,-0.0385954455,-0.0892659798,-0.0282920673,-0.0812748075,-0.0832588449,0.0068376581,-0.0616918467,-0.0796888098,0.0400380604,0.0790278837,0.032450214,0.0376890376,0.0777712464,-0.0635792688,-0.0225253906,0.0161571782,-0.0085354848,0.023592826,-0.0349687673,-0.034409374,-0.0854579583,0.0110868011,-0.0882501155,-0.0103515424,0.0172912441,-0.0276203901,0.0607843399,-0.0155889997,0.0492441207,0.0058395951,0.0053155869,-0.0324462578,-0.0207616631,-0.0845361724,0.03824687,0.0281079579,-0.0261668805,-0.0931875631,0.0238164905,-0.0508724041,-0.0425055735,-0.0356061496,0.0057925317,0.0751093477],[-0.0720590651,-0.0709437504,0.0044186185,-0.0301606655,-0.0098160151,-0.0838826969,-0.0005776198,-0.0348075666,0.0161038525,0.0274603534,-0.0900792032,0.046728231,0.0542551503,0.0096864402,0.0182620212,0.0478876233,0.0010377892,0.0660963655,-0.0021024677,-0.0211081021,-0.0074755675,0.0534287281,-0.0399592742,0.0053487467,-0.0721087828,0.0210686121,0.0698024035,0.0270225517,0.0338680185,-0.0823651329,-0.0110249082,0.0692330152,-0.0461763404,-0.0713675842,-0.0787354335,0.0208078511,-0.091788061,0.0039188303,-0.0001242751,-0.0516376346,-0.0075135729,0.0683969185,-0.0213861521,-0.0814317018,0.0653694794,0.0012988597,-0.0466406234,-0.0294784866,-0.0387264676,-0.0783652812,-0.0648814067,-0.0229582265,0.0370968059,-0.0128359776,0.0045789746,-0.0272891689,-0.0980104208,0.0391942635,0.0904403105,-0.0669590831,-0.0688584894,0.0351867154,0.0294706672,0.0098672947,-0.0598958582,-0.0234753173,0.0295214225,-0.0135694016,0.0656664371,0.0152677838,-0.0351533405,0.0708521605,-0.0014281465,0.0797810033,0.0722965524,-0.0540173091,0.0064270492,-0.0338435285,-0.0139187779,0.029799955,-0.0492829978,0.0924785882,0.0092880558,-0.0646392554,-0.0360238887,0.0672436059,0.061161723,0.0159941614,-0.0285536833,-0.0476273485,-0.0216526892,-0.0654932261,-0.0361031294,0.0214177631,0.0382262282,0.0490863584,0.0660495609,0.0422843806,-0.025934061,-0.0963112041,-0.0784544945,-0.0370017663,0.0227449946,-0.0226787645,0.0659625679,0.0306990985,-0.0011775903,-0.0766298026,0.0739593655,-0.0068689999,0.0629863441,-0.0773143545,-0.0496867709,-0.097757116,0.0522084571,-0.0507211946,0.0679795668,0.0139250224,-0.0244778581,-0.0586254746,-0.0258474443,0.0547395498,0.067445077,-0.0576824173,0.0250332095,0.0289924499,-0.060618449,-0.0185787827],[0.0055962214,0.0277949832,-0.0257715993,-0.0798664093,-0.0602243245,-0.0113920057,0.0308042467,-0.0591233261,-0.003968379,-0.0631833449,-0.071021691,0.0471806824,0.022765344,0.0196082536,0.016254263,-0.0975244045,-0.0479448549,-0.0382071882,-0.0729698241,0.0570547879,0.0675109699,-0.0007863967,0.0838710219,-0.0815140232,0.0342412181,0.0698242411,-0.0557378568,-0.0268127061,-0.0650436431,-0.0784489661,-0.0473814905,-0.0739508271,-0.067588225,0.0659372732,0.0763892233,-0.0340704657,-0.0739466026,-0.054376699,0.0529094599,-0.0665035844,0.0199709442,-0.0447845459,-0.0468495339,0.0593700111,0.0035619265,-0.0366616473,-0.0670361817,-0.0503189005,0.0111495443,-0.0554364361,-0.0208528582,0.0560869873,-0.0677839965,-0.0708854645,0.0777907968,0.0300317053,0.0372614227,-0.0018005354,0.0523316562,0.0495986603,-0.0436630622,0.0663086921,-0.0698962361,-0.0211508404,0.0570184328,-0.0399303846,0.0095917275,0.0208872687,0.08339452,-0.0811740234,-0.0323412679,0.0539911799,0.0298643894,0.0528414547,-0.0887781456,0.0197021924,0.0630347654,-0.0666896403,0.0241359565,0.0010439256,0.0767367855,0.0525419861,-0.0439517349,0.0464631245,0.0489733592,0.0113654872,-0.0176201034,-0.0236433037,-0.0461018123,0.0343372673,0.0616458133,0.0922932699,0.0862160549,0.0320701785,-0.0699984431,0.0333474986,0.0000826163,-0.0447359271,0.0576018654,0.0418452136,-0.0688131377,0.055763673,-0.0004879969,-0.0138527844,0.0512739122,0.0306999423,0.0611210801,-0.0167050157,0.0514822006,0.0252285302,0.0498400182,-0.0148259792,0.0771344006,0.0542005599,0.0494024716,-0.0858180225,0.0812767521,-0.0134913009,-0.0736596286,0.0743135065,-0.0658475608,0.0339757316,-0.0699369833,0.0664827228,-0.0745849907,-0.0685472339,-0.0869785771,-0.0245222375],[0.0293147173,-0.0889805183,0.0097273355,-0.0344905034,-0.0721202269,-0.0564662702,0.0117835924,0.0535976253,0.0502718538,-0.0554721132,0.0011773916,0.0708394945,-0.0121878348,0.0073534315,-0.0767396688,0.073583886,-0.0112784775,0.0383132733,-0.0096872104,0.0421996266,0.0460972674,-0.0724625885,-0.0913306922,0.054436367,-0.0244513191,-0.0573929884,0.0577045381,-0.0291296802,-0.0531895049,0.0189149175,0.0221530125,-0.0439868309,0.0716836378,-0.0505141988,-0.0285878927,0.0144666163,-0.015975669,0.0322934166,0.0675337389,0.0798396617,0.0231947452,-0.02079813,-0.043477945,0.0115738548,-0.0558863953,0.0901075676,0.0174039509,-0.0602078438,-0.0093625281,0.0198628753,-0.0500144847,-0.0061796699,0.0802769214,-0.0078887194,0.0711619705,0.0814655125,0.0062995688,-0.007463804,0.0675069243,-0.0320558734,-0.0359508768,0.0443875454,0.0666062087,-0.0605061911,0.0692851916,-0.0810527578,-0.0234119054,-0.0296496637,-0.0077339597,-0.0600762591,0.0520499162,-0.0725479126,-0.011624461,0.0451439433,-0.0926670134,-0.0113860909,0.0398592316,-0.0374170616,0.0749119148,-0.0231108814,0.0066454131,0.0495598875,-0.0205290206,-0.0814705491,0.0345812216,0.0257672723,-0.0770959035,0.0329752751,0.0004319382,-0.0059459717,-0.0153810084,-0.004825132,-0.0732818246,-0.0518867113,-0.0295342244,0.0335031971,0.0687729269,0.0808134302,0.0610315688,0.0042809355,0.021792965,0.052115757,0.0631813407,-0.0553181805,0.0758217201,0.0770156384,0.0530390553,0.0501942635,-0.0950454846,0.0384435244,-0.0297653135,0.0488745719,0.0608216859,0.0510814451,0.0184224099,-0.0751101002,-0.0214414485,-0.0808862299,0.0446642339,-0.0734167099,-0.063229993,-0.0612269342,-0.047285296,-0.0531484075,-0.0044289795,-0.0633712262,0.003341076,-0.0158925336],[0.0826947019,-0.0982964188,-0.0758680627,-0.0212950241,-0.0848808959,-0.0751124769,0.0456012115,-0.0037496609,0.0621896088,0.0852121115,-0.0361723118,0.0702384412,-0.0009855197,-0.0484360643,0.071907416,-0.0308654886,-0.077641435,0.0021396144,0.0010542783,0.0777647868,0.0669559762,-0.0087060928,-0.075135611,0.0434965789,-0.0334445797,-0.0572295561,-0.064368844,-0.0708762035,-0.0214833617,-0.0636047125,0.0275791958,0.0502712317,0.0047085374,-0.0587233454,0.0477534719,-0.0254182685,0.0753019676,0.058983732,-0.010258344,-0.0199742932,0.0112349242,0.0332372859,-0.0600715056,-0.0576863922,0.0616774336,0.0558732301,0.0723714083,0.0443445481,0.0136814956,0.0569370426,0.0872388706,-0.0641798154,-0.012499366,-0.0656035617,-0.0897095501,0.0555992723,0.0295836516,-0.0454550348,0.0915076211,0.0387405083,-0.0270065889,0.0245378241,-0.0725032687,0.0514168665,0.0051841852,0.0587613285,0.007972396,0.014761867,0.0085469224,-0.0365177765,0.0531036295,0.0930830389,-0.0130739072,0.0584015772,-0.0505461209,-0.0236278027,-0.0409414098,0.023383975,0.0346249379,-0.0450491831,0.0583355799,-0.0448658466,0.0825492963,-0.0533563495,0.0477390923,0.073125042,0.0568807237,0.0257491786,0.0469395705,0.0584886931,-0.0008102153,-0.0457288399,0.0199959353,-0.0358111262,0.0763876364,-0.065800719,-0.0828001425,0.025311945,-0.0414646231,0.0059200986,-0.0155217955,-0.0202734098,0.0322916806,0.0648842305,-0.0880738497,0.0689922944,-0.0560879633,0.0704009235,-0.0672814846,-0.0089025274,-0.0429250523,-0.0595786832,0.0307258517,-0.0232092924,-0.0479062684,0.0449217707,-0.0242900401,0.0571551695,-0.0103074545,-0.0081652971,-0.0507349595,-0.031577222,-0.079197824,-0.0674028546,0.082965374,0.0663921088,0.053629715,-0.0376991332],[-0.073632583,-0.0263980683,0.0531944931,0.0530270152,-0.0566586591,0.0273043308,-0.0147720063,0.0527874418,-0.0063501853,0.0730339438,0.0553119555,0.0624763258,-0.0601789169,-0.0207207501,-0.0576556064,-0.0706729963,0.0263630003,0.0608023666,0.0876438618,-0.0191138722,0.024195455,-0.0431287065,0.0549684353,0.0883450955,-0.0274944305,0.0146623636,0.0585004091,0.0474732332,-0.0090221921,-0.0234436803,-0.0691860616,0.0472365059,0.0785154849,-0.0137094138,-0.0311077274,-0.0772261471,0.0032062146,-0.0789171383,0.0386696458,0.0056172335,-0.0689195246,-0.0458936878,-0.0105046993,-0.0792313144,0.0651904941,0.0046833917,-0.0073390063,0.0178088564,-0.0187491886,-0.0597940311,0.0355780274,-0.0323200226,-0.0165783875,0.0203317311,0.0625200197,0.0711215138,0.0010824309,0.026755238,0.0644106641,-0.0427105352,-0.0860589072,-0.0564793423,0.0014837699,-0.0230432395,0.0439974852,-0.0697386488,-0.0527213849,-0.0876177996,0.0316421948,0.0020020879,-0.0404958986,0.0692298189,0.0470979623,-0.0076632039,-0.0729849264,-0.0537207052,0.0357945785,0.067914702,0.0859101191,0.0425869934,-0.0933035761,0.0177244488,0.0775282606,-0.0568853654,0.0786130652,-0.0301466621,-0.0173234455,-0.0230254084,0.0033432408,-0.0722304359,-0.0210924596,-0.0720315054,0.0726671964,0.0936251804,0.0390160829,-0.0004267387,-0.0708088875,-0.0719175711,0.0338790566,-0.0116127236,0.0580365136,-0.0502387434,0.0654462576,0.0060631903,-0.0191887729,-0.005426784,0.0115586165,0.0205114931,-0.0439680293,0.0632711723,0.0052241841,-0.0531778373,0.0606608018,-0.0167260449,0.0165800955,-0.0790759325,0.0243440252,0.0557043739,0.015384702,-0.0729864016,0.0427035652,-0.0874454379,0.028715875,0.0714973733,0.0579578653,-0.0088278865,0.0643630773,-0.0279295258],[0.0854661837,0.0435126759,-0.0772428513,-0.0581520088,-0.0858642235,-0.0939700752,0.0556464233,0.0393611938,-0.093388997,0.0167953111,-0.0789379403,-0.031528607,-0.054864116,0.0746366903,-0.0174130071,0.0130522233,0.0847466886,-0.0506123677,0.0468461327,-0.0763169378,0.0799407661,-0.0126382159,-0.0381185897,0.0416414142,0.0397025421,0.0294471756,-0.0044109165,0.0236133523,0.0698648617,-0.0179543719,0.0246575605,-0.0462712683,-0.0234781858,-0.0291638672,0.0801975578,0.0385000482,-0.071248509,-0.00023527,0.058373861,-0.0382697992,0.0687138811,0.0186721254,0.045917429,-0.072574608,-0.0282603912,0.0177239217,-0.0769140422,0.010654713,-0.0166189075,0.0297383182,-0.0415880494,-0.0263098981,0.0660892278,-0.0580413193,0.0280838422,0.0452086106,0.0660318881,-0.0748533234,-0.0063290657,0.0140282251,-0.0184160098,0.0234403145,-0.0523972884,-0.0321418345,-0.0271784365,-0.0826297477,-0.064965345,-0.0301080737,-0.0244770274,-0.0620302558,0.0520568043,0.0236498546,0.0264575388,-0.042215649,-0.0195117891,0.077322118,0.0445389338,0.0761429518,0.0099648284,-0.0443579517,0.0655096099,0.0271453802,-0.0175865311,-0.0855761021,-0.0439674817,-0.0259428974,-0.0663784519,-0.0882305801,0.0616332032,-0.0283192638,0.0197929051,-0.017531205,-0.0224867016,-0.0472527668,0.0169569142,0.0384892337,-0.0464008451,0.0027593935,0.0163313951,0.0062749782,0.0755518749,-0.0195708852,0.0046344888,0.0545563437,0.0657147318,-0.0651839525,0.0705575272,0.0332526863,-0.0077746063,-0.0204996746,-0.0173852686,0.0815765485,-0.0420828238,-0.0015114989,0.0723922551,-0.0721069723,0.0846297294,-0.0093892561,0.0817526057,-0.030430818,-0.0587135255,-0.0348256677,-0.0845081434,0.0279995911,-0.0343494788,0.0041156663,-0.0645005256,-0.0637586191],[0.0802935064,-0.0453048982,0.0362990052,-0.0601482689,0.0468924195,-0.0251286402,-0.0558265783,-0.0754667297,0.0648144633,-0.0638441816,0.0160114095,-0.0052186539,0.0874409825,-0.0193756782,-0.0238102488,-0.0699074492,0.0149519909,0.0069016772,-0.084090285,-0.0409718119,-0.0141815608,0.0728742331,-0.0358813368,-0.0421521142,0.0405953564,0.0170516465,0.0637754723,-0.0074437303,0.0286182929,0.0794489682,0.0706563517,-0.0128242662,0.0409457684,-0.0611210875,-0.0042852806,-0.0457170382,-0.0159739051,0.0425437018,0.0806793496,-0.0461880118,0.0080858618,0.0454708487,0.0070430855,0.0536788814,0.0353629515,-0.0285286568,-0.0822090656,-0.0844130516,-0.0530910827,-0.0432953425,-0.0222364515,0.0300174467,-0.0558991693,-0.0304187369,-0.001024855,0.0322314687,-0.0052844081,-0.0333254151,-0.0508880541,-0.0882679224,-0.0610131733,-0.0144737223,0.0266340766,-0.0701618716,0.0502186231,0.0468642935,-0.0078089102,-0.0395369604,-0.04590578,0.0881205201,-0.0805752352,0.0561579317,0.0333465822,0.0341862403,-0.0733595863,-0.0691554323,0.0356388278,-0.0495750234,0.069901742,-0.0635776892,-0.0555879474,-0.0589755252,-0.0744993463,-0.0329416506,0.069131501,0.0353219397,-0.0861696824,0.0152398879,-0.0845077783,0.007446229,0.0132477582,0.0115186479,0.0475956053,-0.0018904362,-0.0181311537,0.0665835515,-0.0289662722,-0.0892229527,0.03683706,0.0560782999,0.0203453042,-0.0972029939,-0.0671959668,0.0244781468,-0.0653643087,-0.0329673886,0.0107891569,0.0346112363,0.0692636743,0.0069132107,0.0030499548,-0.0879478678,-0.0846091285,0.047163114,-0.0019603048,-0.0706321672,0.0020229698,-0.0620647483,-0.0892682299,-0.0480805151,-0.0086944774,-0.0501451045,-0.0400594324,0.0272950977,0.0071448097,-0.0294326097,-0.081170246,-0.0755319148],[0.0418168493,-0.0433741659,-0.0668572709,-0.0104706632,-0.0780365542,-0.0361225493,0.0586939752,-0.0722232461,-0.0163843241,0.0721361563,-0.027318269,0.0316055603,0.0403591469,0.064825967,-0.0262945779,-0.099900499,0.0139034037,0.083949104,0.0339721367,0.0766858011,0.0063229641,-0.0523962229,0.0635617673,0.0869781151,0.0249496698,-0.0473798066,-0.0823275372,0.0798338726,0.0796976686,-0.0067377961,-0.0617648587,-0.0835219696,0.0242008567,-0.081200406,0.0066434508,0.0783056393,-0.0578025244,-0.095761247,0.0221801214,0.0306148976,0.023371052,0.0785621554,-0.046664387,-0.0162890218,-0.0093989745,0.0241404139,0.0415509455,0.0497769602,-0.0181417484,0.0449879058,-0.0520322323,-0.0370454378,0.0098563256,-0.0420732275,-0.0793627575,0.0723711252,-0.0074963961,-0.0529019795,0.0222813189,-0.0040095532,0.0367348157,0.0232044924,0.0054962113,0.0326808766,0.0239573773,-0.0440864414,0.0245858394,-0.0235275161,0.0554062463,0.0069510471,0.0735956877,0.0309019312,0.0045700343,0.0336909965,0.0838177428,0.0755566731,0.0889882371,-0.0628374964,-0.0672510639,0.0594015829,-0.0947989598,0.0823348612,0.0691828355,0.0812328905,-0.0277666636,0.0579256825,-0.0531943887,-0.0647858158,0.0056855371,-0.0925244763,0.0147967795,-0.0133416634,-0.0096158087,-0.0630764812,-0.0448043384,0.0149579616,0.0294132624,0.0497953855,-0.0348826051,0.0578941107,-0.0385123044,0.0722334385,-0.0695277452,0.0778780729,-0.079189375,-0.0806423798,0.0475723296,0.0099337799,-0.0445015058,-0.103838779,-0.0383153558,0.0172192976,0.0780944079,-0.1042660475,0.0276534986,-0.0726128668,-0.0786275119,-0.00312597,-0.0418504626,0.0182842631,0.0189265758,-0.0237468351,0.0426068977,0.0302871987,-0.0339830518,-0.0629824623,-0.0811173916,-0.0617318526],[0.0778508633,0.0322120935,0.0661887676,0.0661427528,-0.0772808269,-0.0404541455,-0.0113915782,0.015258438,-0.0041242307,0.0794619173,0.0656380206,-0.0826019496,-0.0086178491,-0.0365492776,0.0241807904,-0.0271096639,-0.0176337007,0.0418040529,-0.0313579738,0.0345244966,-0.0735497102,-0.0800591484,-0.042188935,0.0044863746,-0.0528676696,0.0877596289,-0.0625906363,-0.0010761629,-0.0244288743,-0.0819291323,-0.0486991331,-0.0304161329,0.0888646841,-0.009131413,0.0702895746,0.0658741593,-0.0839827433,0.0651608184,-0.0693037063,0.000912155,0.0605101958,0.0889795348,0.0563822724,-0.0018469978,0.0614767894,-0.0029748166,-0.0689681694,-0.048382964,0.0636543557,0.0060854945,-0.0210262183,0.0556234494,0.072476171,-0.0754523501,-0.0211904738,0.0162480604,0.0337390564,0.0198166743,-0.0520476438,-0.0111493254,-0.0763970688,-0.0047804592,-0.0644517243,0.0312560536,-0.0566629209,-0.0111758178,0.0379011184,0.076226607,-0.0573363677,0.0667180344,0.019000547,0.0647082478,0.0126426909,-0.0074812607,-0.0172481872,-0.0365528911,0.0388287455,-0.0644724146,-0.0016789479,-0.0081985807,0.0540997535,0.0078336531,-0.0365528725,-0.0690674186,0.0483431332,-0.0788676366,-0.075450778,-0.0105313333,0.0448730253,-0.0244352259,-0.0766417459,0.0166782178,0.0329799168,0.0526176281,0.0245969724,0.0710483491,0.0494563989,0.0460949838,-0.0840412751,-0.0772102997,0.0184586961,-0.0077369669,-0.0042811781,-0.0326700993,0.0567959547,-0.0619681068,-0.0956025273,0.0459654517,-0.0616838075,-0.0605542064,0.0305079371,0.0286218598,0.0439682305,-0.0072294893,0.0837241709,-0.072428368,0.0684619397,-0.0455562621,0.0620354414,0.0323395841,0.0450079702,-0.0944450945,-0.0171033833,-0.0524518155,0.0419226699,0.0456550531,0.026806565,0.0070660384],[-0.0531174392,-0.068878606,-0.0967447385,-0.0907931179,-0.0563388579,-0.0522512831,-0.0034792991,0.0915224776,0.0564446039,0.0644571185,0.0563218109,-0.0596844144,-0.0012406982,-0.063523449,0.0193860307,0.0092916125,0.0733530521,0.0343629085,-0.0166446902,0.0083796056,-0.0396929309,0.0046197874,-0.0686518624,-0.0807636976,-0.0412341468,-0.0008281934,0.0284816343,0.0702557042,0.0082307905,0.0462002009,0.0146429818,-0.0923259705,0.06998346,0.003928341,-0.0636943802,0.0076870653,-0.0290374514,0.0701299012,0.0122875245,-0.0029760515,0.0019056974,0.0818696767,-0.0490070954,-0.0432564802,-0.0198008232,-0.0525629073,0.0518737361,-0.076738961,-0.088987492,0.0747851953,-0.0551412404,0.0913250819,0.0545185246,0.043642085,-0.0583835579,-0.0135522336,0.0049758889,0.0748076439,0.0850393102,0.0160429962,-0.0153800072,-0.0040540304,0.0008620365,-0.0881875381,-0.0305943172,0.0686011985,-0.0467613302,0.0321510285,-0.0701211989,0.0758655816,0.0278548226,-0.0009328123,-0.0254071038,0.0221448503,0.0153142186,0.0044437796,0.0149217434,0.0357528627,-0.0104671521,0.066757828,-0.029754743,-0.06428352,-0.0197302867,0.0586295836,0.0881458446,0.0602619462,0.03325155,-0.023504775,-0.0164244007,-0.0933846757,-0.0409121066,-0.0137553317,0.0810317397,-0.0249841399,-0.0813378766,0.078363359,-0.0029433751,-0.0578108914,-0.0470880717,0.0403189436,-0.083269313,-0.0591154397,-0.068796061,-0.0807421878,-0.0151567329,-0.051286567,-0.046489276,0.0608157627,-0.0223419573,0.076379396,0.0550213456,0.0038076022,-0.0390784927,0.0563569181,0.0460554175,0.0248324666,-0.0560001545,-0.0290777851,-0.0695611611,-0.0398825072,0.0803272277,0.0770829469,-0.0387661718,-0.0026960627,0.0625962764,0.0051871273,0.0379063264,0.0466772318],[-0.071837306,0.0283879284,-0.024178708,0.0085651977,-0.0949022844,-0.0764915422,0.0713723078,-0.0009450006,-0.0740011707,-0.0795997083,-0.0206529871,0.0575304367,0.0232026316,0.0979028642,0.0572958365,0.0752637461,-0.0036552662,0.0522664934,0.0517838076,0.0123395519,0.0955629274,0.0779043511,0.0434009433,-0.0552623086,0.0768522918,-0.0637124106,0.0558849201,-0.0628329888,-0.0062300288,0.0116670039,-0.0723783225,0.0374500342,-0.0247098915,-0.0124433106,0.0819467977,0.0732710287,0.0431170203,0.065279901,-0.0166053176,-0.0824136734,-0.052763205,0.0486148521,-0.0293654371,0.0143380081,-0.0599067733,-0.0622814111,-0.0154451998,0.0744341165,0.0364434458,0.0351700447,0.06135552,-0.0519663766,0.0055819936,-0.0600412898,-0.0259669516,0.002014182,-0.0460803695,0.0234998167,0.0744843781,0.0150899636,0.0470430776,-0.0491802469,-0.0635965392,0.040877942,0.0127259362,-0.0031022434,0.0029533366,0.0732513219,-0.0143530434,0.0444605164,0.0344131254,-0.0287957527,-0.0717633739,-0.0622729696,0.0458581895,0.0313989259,0.0087127294,0.0647781566,0.0863584578,0.0134729454,0.0175137613,-0.0469561405,-0.0490992963,-0.0112011246,0.0497296266,-0.0560703687,0.0389281809,0.0252370201,-0.0774788111,-0.0416024365,0.0216148794,0.0230923742,0.0465248227,0.0391902477,0.0871030241,-0.0305707268,-0.037835408,-0.0768449754,-0.0645990893,-0.0848137811,-0.0430160724,0.015817238,-0.0237130914,0.0624115579,0.0230694879,-0.066956751,0.0529926978,-0.0646014735,0.0781461298,0.0199668221,0.0677232817,-0.0647350326,0.0032694838,0.0606174618,0.0725324824,0.0434506088,0.057914231,-0.0301988218,-0.0576581173,0.0761186853,-0.0551020056,0.0502879955,-0.0608775839,0.0544430651,-0.0726633668,-0.0470928997,-0.0826824605,-0.0412098467],[-0.0129172569,0.0118752085,-0.0889901966,0.0413188413,0.001736731,0.0362399034,-0.0797457173,-0.0399028957,-0.0109057194,-0.0421619974,-0.0902798101,0.0240665693,-0.0772650987,-0.037588615,-0.0403751247,0.0496947654,0.0336710885,0.0679709017,0.0850659534,-0.0360495523,-0.0658990666,-0.0497171842,0.0824520662,0.0551051125,0.0135636507,0.0515398681,0.0192512814,-0.0791565925,0.0324657783,-0.0450835489,-0.0601021647,-0.0169542525,0.0407034867,0.0721636415,-0.0128853098,-0.0575484,0.0227138177,-0.0636940449,0.0382960141,0.0657948777,-0.069656387,-0.0715811327,0.0639541671,-0.0079895807,0.0722589865,-0.0785839334,0.074503012,0.058579471,0.0804431438,-0.0712560266,0.0254210941,-0.0337461196,0.0518218726,-0.0839635655,0.0516389459,-0.0071805804,-0.0062454464,-0.075217329,0.0314738639,-0.0027602646,0.0052028182,0.02328513,0.0121997017,0.0606339984,0.0331465192,-0.0849025026,-0.0684308931,0.0135570597,-0.0414351895,-0.0815931782,0.0241540726,-0.0278359577,-0.0815283507,0.0599713512,-0.0576009005,-0.0891743749,-0.0019352883,-0.0288086068,-0.0173933133,-0.046345409,0.0445510559,0.0530633777,0.0816119611,-0.0455335304,-0.0310024191,0.0746776015,-0.0199051127,-0.0415249988,0.0762372985,-0.0435409546,0.0946441293,0.0648358762,0.045373857,-0.074287802,-0.0615469962,-0.0750742033,-0.0329853408,0.068330653,0.0458692536,0.0244560633,-0.0831426084,-0.0932915211,0.0051637967,-0.0917760879,-0.0075487122,0.0255616959,0.0033116664,0.0216687303,0.0395752937,0.0156427734,-0.0120851938,-0.0118430573,0.0531318113,0.0662765726,-0.018283857,-0.0327577516,0.092016764,0.0373382159,-0.0233674571,0.0259739365,-0.0196640771,-0.0044766343,-0.078921251,0.0712106302,0.0208852887,0.0328665376,-0.0773226991,-0.0618614219],[0.0031900825,-0.0126704061,0.0699609369,-0.0637746826,0.0192473661,0.022168275,-0.0988649055,0.0034109647,-0.0704509765,0.0951067731,0.0596860275,-0.0865427852,-0.0252443366,-0.0226243362,-0.0550398231,-0.0933257416,-0.0034386727,0.0458005928,0.0044972962,-0.0109922979,0.0711077452,-0.030674547,-0.0428731181,-0.0203955825,0.0153778503,-0.0496642366,0.0152946748,0.0464660786,-0.0782818496,-0.0021862809,-0.0744045824,-0.0249936581,-0.0031867807,0.0098260716,0.0564949997,-0.0338514261,0.0370974317,0.0666616485,-0.0325618684,-0.0232673194,-0.0060597402,-0.0544640459,-0.0932179093,0.0195665527,0.0422654562,-0.031702321,-0.0031790889,-0.0004734053,-0.088782534,-0.0423948504,-0.045625411,-0.0159533098,0.0954863876,0.0181316491,0.0071173161,0.0467535146,-0.0134430379,0.026417274,0.0349095538,0.0789055899,-0.0865576416,0.0041498384,0.0656087399,0.0334003046,0.0273371898,-0.045780044,0.0025927797,-0.0556718707,0.0009275201,0.029838847,0.0172947776,0.0502233692,0.0672090948,-0.0012302368,0.0494248867,0.0794381797,0.0543504022,-0.0415620767,-0.0308088772,-0.0027579835,-0.0813506916,0.0146579249,-0.0466799699,-0.0035014011,-0.0630674511,-0.0379282422,0.0544237196,-0.0823425651,-0.0781391487,-0.0205656197,0.0625683963,-0.0553410798,0.0012775514,-0.0681367889,0.0823352635,0.0030603271,0.078088969,0.009355709,0.0557607375,0.022176018,-0.0274466202,0.050015334,-0.0496772304,-0.0123565886,0.0577613674,0.0084589282,-0.0814679638,0.0490196496,-0.047532361,0.0227596033,-0.0964779034,-0.0666098222,-0.0140676685,0.0354594328,-0.0529416539,0.0032689383,0.0064819632,-0.0725282803,0.0199841391,0.0003342673,-0.0941636935,-0.0570253171,0.0427355394,-0.0441109911,-0.0409474261,-0.0741635188,-0.0431612432,-0.0155031355],[0.0067170938,-0.0800989941,-0.0927000716,0.0395282023,-0.0120806322,-0.0614756905,-0.0974761844,-0.0189683326,-0.0438087285,-0.0709675401,-0.0409366004,-0.0746792033,0.0771530643,-0.028020557,0.023596013,0.0102863573,0.0890638977,0.0534437075,0.0221014638,0.0701653808,0.021386316,-0.0354026221,-0.0762546584,0.0621130206,-0.0016494391,-0.0641658604,0.0115769869,-0.0272699669,-0.0511827208,-0.0469113775,-0.058376275,0.0241561029,0.0851151943,-0.0078681726,-0.0768963993,0.0515982546,0.0340225846,0.0666883737,-0.0678311437,-0.0011481775,0.0201278664,-0.0417997614,-0.0026440402,0.0800361931,-0.0677760094,-0.0323552862,-0.0641682968,-0.0567658916,-0.0686444044,0.0364359133,0.0558645874,0.0513121486,0.0478647351,0.0562362112,-0.0288414974,0.0460693426,0.0788150132,-0.0511359163,0.0476204455,-0.0937482119,0.0627052709,-0.058372654,-0.063752465,-0.0427197926,0.0274644047,-0.0216541737,0.0826965198,0.0780004486,0.0720596835,-0.0752153546,0.0307858493,0.0650308356,0.0740806758,-0.0738339573,-0.0247139204,-0.0908164307,0.015753679,-0.0879393667,0.0563034862,-0.0521976165,-0.0612406358,0.0145098614,-0.0541113913,0.0462519303,-0.0353892893,-0.0869699195,-0.0552981459,0.0702124685,-0.0740350708,0.0814501941,0.0689549074,-0.0322895981,0.0707182661,-0.0401096791,0.0153557435,-0.0672327206,-0.0927603394,0.0405068025,-0.0604257695,-0.0902547315,-0.0895564556,0.0573767982,0.0693821386,0.0763370842,0.0018754841,0.0067129191,-0.071868442,-0.0853488967,-0.0619978942,0.0027197096,0.0664439946,0.060760323,0.0540384389,0.0049871854,-0.0805095285,-0.0070108906,-0.0186183434,-0.0806254447,0.0098271826,0.0248638093,0.0024012078,0.0160067938,0.0025242108,-0.0346405059,0.055861149,-0.0479185246,-0.072092481,-0.0461317003],[0.040645849,0.073000364,0.0529021397,0.0294614024,0.0166702475,-0.072054483,