{"model":{"name":"model_1","layers":[{"name":"x_100","class_name":"InputLayer","config":{"batch_input_shape":[null,100,643],"dtype":"float32","sparse":false,"name":"x_100"},"inbound_nodes":[]},{"name":"x_40","class_name":"InputLayer","config":{"batch_input_shape":[null,100,643],"dtype":"float32","sparse":false,"name":"x_40"},"inbound_nodes":[]},{"name":"x_raw","class_name":"InputLayer","config":{"batch_input_shape":[null,100,643],"dtype":"float32","sparse":false,"name":"x_raw"},"inbound_nodes":[]},{"name":"lstm_1","class_name":"LSTM","config":{"name":"lstm_1","trainable":true,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"units":32,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1.0,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.0,"recurrent_dropout":0.0,"implementation":1},"inbound_nodes":[[["x_100",0,0,{}]]]},{"name":"lstm_2","class_name":"LSTM","config":{"name":"lstm_2","trainable":true,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"units":32,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1.0,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.0,"recurrent_dropout":0.0,"implementation":1},"inbound_nodes":[[["x_40",0,0,{}]]]},{"name":"lstm_3","class_name":"LSTM","config":{"name":"lstm_3","trainable":true,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"units":32,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1.0,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.0,"recurrent_dropout":0.0,"implementation":1},"inbound_nodes":[[["x_raw",0,0,{}]]]},{"name":"concatenate_1","class_name":"Concatenate","config":{"name":"concatenate_1","trainable":true,"axis":-1},"inbound_nodes":[[["lstm_1",0,0,{}],["lstm_2",0,0,{}],["lstm_3",0,0,{}]]]},{"name":"dense_1","class_name":"Dense","config":{"name":"dense_1","trainable":true,"units":64,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["concatenate_1",0,0,{}]]]},{"name":"dense_2","class_name":"Dense","config":{"name":"dense_2","trainable":true,"units":32,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["dense_1",0,0,{}]]]},{"name":"dense_3","class_name":"Dense","config":{"name":"dense_3","trainable":true,"units":16,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["dense_2",0,0,{}]]]},{"name":"dense_4","class_name":"Dense","config":{"name":"dense_4","trainable":true,"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["dense_3",0,0,{}]]]}],"input_layers":[["x_100",0,0],["x_40",0,0],["x_raw",0,0]],"output_layers":[["dense_4",0,0]]},"weights":[[[-0.0787663385,-0.063191697,-0.0594349541,-0.0658847094,0.0242254473,-0.0738915578,-0.0384519808,-0.0310158227,0.0759627372,0.025714051,-0.0107153654,-0.0636109039,-0.0092199901,-0.0581069291,-0.1036992446,-0.0288121682,-0.0128590744,0.0082152551,-0.0233152546,0.00544773,-0.0037511336,0.0214220732,0.073659353,-0.0448345803,0.0727727562,0.0155912284,-0.0294284485,-0.0069381287,0.0118851876,0.0405579284,0.0090931728,0.0899789855,-0.0552483834,-0.0356645063,-0.0551522076,-0.0127578499,-0.0075265733,-0.0170148443,-0.0711472258,-0.0368123464,0.0606920533,-0.0001687207,-0.008886328,-0.0257750116,-0.0127837611,0.0301281195,-0.0767320618,-0.0776603967,0.0038601521,0.0671053082,-0.0433241427,0.0469899178,-0.0667398125,0.0399773903,-0.0665862411,0.0499119796,-0.017548915,0.005151568,-0.0729290172,-0.0547092855,-0.0050344435,0.0696247369,-0.0773288906,-0.0097292028,0.0536837913,-0.0340259373,-0.0167986285,0.0416734032,-0.0145074986,0.0107848607,-0.0510746799,-0.0668966249,0.064791359,-0.0678894818,0.0667141825,0.0818971843,-0.0708707646,0.0446631461,0.0159328487,0.023630172,0.0663011521,0.037153624,0.0124555537,0.0675620213,-0.0035023687,0.0079066902,0.0860633031,-0.0612289459,-0.0341058224,-0.0048822071,-0.0173613578,-0.0675745755,-0.0340822786,-0.0696764663,0.0559780225,0.0322217494,-0.0133584822,-0.0746227056,0.016177306,0.0327849686,0.0222825743,0.022171678,0.0101771662,0.0595487207,0.0246370304,0.0719356164,-0.0407862663,0.0174506176,-0.0240503978,-0.0396398865,0.0509245954,-0.009545058,-0.0132495929,-0.0412573293,-0.0365727469,-0.0192635115,-0.0682659745,0.0749360248,-0.0324920304,0.0050658514,-0.0157958139,0.005475664,-0.0319500193,-0.0124143325,0.035897471,-0.0598438643,-0.0303576887,0.0963123068],[0.0026222358,0.0764463469,-0.0153726758,-0.0270698294,0.0030165873,0.0034243313,-0.0197430644,-0.0011251922,-0.0609362982,0.0204493236,0.0554285906,0.0355034694,0.0436724685,-0.0153028732,-0.0312529057,-0.0188508593,-0.0200439803,0.0666354671,0.0521838367,0.0481021926,-0.0020071217,-0.0343060903,-0.0722454414,0.0429582223,0.0146989608,-0.023086153,0.0598685443,-0.0521940738,0.0596496761,0.076114729,0.003866802,-0.027866073,0.0309415534,0.0082245423,0.0662591755,-0.0746143386,0.0075919777,-0.0362318791,0.0280598905,-0.044308655,-0.0631164908,0.0362074487,0.0507421792,-0.0626475066,-0.064298138,-0.0597733855,0.0710748434,0.0102245566,0.0628454611,0.0258929934,0.0853140131,0.0160748158,-0.0460987948,0.0121605769,-0.0851556063,0.0420237705,0.0178933665,0.0760239735,-0.0083521744,-0.0328706168,0.010936657,-0.065870598,0.0395509861,-0.0502955094,0.0352754518,-0.0087804357,0.0530643277,-0.0501088873,-0.0366204791,0.0095966626,0.0332143642,-0.0033757177,-0.0140592372,-0.0619263984,0.0067134132,0.0293323305,0.0353658423,0.039179001,0.0024738673,-0.0720202923,-0.0935691595,0.0723080561,-0.0062784716,0.066427432,0.0214726217,0.0075788666,0.0838059485,0.0333812907,-0.0814071819,0.003480444,-0.0479311422,-0.028083032,0.0272609256,-0.0457712896,0.0761784092,0.025522586,0.0693686455,-0.0326658599,0.0512701645,0.0500032604,0.0346261039,0.0288993884,0.0347688012,-0.0146918111,0.0082124174,0.0130182551,-0.0092536658,0.0654737055,-0.0083123343,0.0831567571,-0.0895537734,-0.0840260759,-0.0617697015,0.062124338,-0.0527433306,-0.0523429587,0.0175333377,-0.0234284941,0.066715993,-0.0526566282,-0.0753872022,-0.0423561111,-0.0665048435,0.045334857,0.0147873517,0.0459545925,-0.0259227697,-0.0497590154],[0.048565343,0.0337322652,0.0218291543,-0.0225876495,0.0093375156,0.0296108555,0.0561451763,0.0123470854,0.0484354757,-0.0414570719,0.0045925719,0.0323451571,-0.0600514337,-0.0539365411,-0.094109863,-0.0101902829,-0.0555723608,0.0582515262,-0.0202966966,0.0363043658,-0.0295454748,-0.0606393591,-0.0781870857,0.0671728551,-0.049798172,-0.0158861689,-0.0137270158,0.0089572323,-0.0929731727,0.0264933482,-0.0386104919,0.0530226976,-0.0664493963,-0.0923634991,0.0370943695,0.033864297,0.0827301517,-0.0151244365,-0.0143438503,0.0902607515,-0.0603648946,0.0486650728,-0.0480859987,-0.093426615,0.0533991419,-0.0421381406,0.0597416237,-0.0111373086,-0.0694234893,-0.0432203785,0.0816568732,0.0492249243,-0.0712966919,-0.0439008586,0.0429297462,-0.0611742325,-0.0546905622,-0.0022091032,-0.0565057136,0.0579834692,-0.0019603637,0.0741650835,-0.000770793,0.0754060298,0.0307753067,0.0759005994,-0.0548097491,-0.0012295153,0.0391300656,-0.0267077629,-0.0255734865,-0.043077264,0.0244934,0.0556141026,0.0513520464,0.0783137158,-0.0241987202,-0.0033077775,-0.0137274629,-0.0231976621,0.0782063454,0.0322485939,0.089664489,-0.0006058288,0.0081065651,-0.0065269107,0.0831694603,0.0133213475,0.0743807927,0.0316533893,-0.0090583134,0.0609976761,-0.0673968643,-0.0045302836,-0.0696604326,-0.0607167333,0.0073800506,-0.0538470261,-0.0411692262,-0.0755719021,0.0039844648,-0.0190225299,0.0636915788,-0.0738647878,0.0787991509,0.0139197651,0.0685422346,0.0480108745,0.0097695254,-0.0700083449,0.0110870311,-0.0525987148,-0.0227599554,-0.0128368316,0.0563618764,0.0459066443,0.0020193064,0.0612585023,0.0059493985,0.0274938457,-0.0577370897,0.0152358366,0.0382271633,0.012142499,-0.0418403819,-0.0504810289,-0.0181147065,-0.0643329099],[-0.0753377751,0.0737822875,0.0603249371,0.057839442,0.0490249507,-0.0422763564,0.0577009022,-0.0470877625,-0.0854782537,0.0709479749,-0.0921046957,0.0704393834,-0.0792646036,0.0603579804,0.0499557965,-0.063135393,-0.0320184268,-0.0890706703,-0.0679869279,-0.0027328681,0.0143367872,0.0743639693,0.03119196,-0.0104607781,0.0561379492,-0.0805147514,0.0529780053,0.0489665754,-0.017114643,-0.0690137744,-0.0133029921,-0.0076132659,-0.0787284896,-0.0208445247,-0.064964518,-0.0615499727,0.0098035662,-0.06689132,0.0155867795,-0.032295242,-0.0823213905,-0.040981181,-0.0888173357,0.0025351364,0.0287942383,-0.058230646,-0.0751903281,0.0733861402,0.0419418029,-0.0667546913,-0.0692744553,0.0266620517,0.0736624375,-0.0133465622,0.0487233475,0.0877837986,-0.0847704187,0.059210632,0.0373340845,0.0789988115,0.0425024778,0.0561741404,0.0416506082,0.0626513585,-0.0360471345,0.0235310663,-0.0854413807,-0.0762349442,0.0814296603,-0.0197968427,0.0827490836,0.0557017513,-0.0866248831,-0.0530805402,0.058686506,0.0111061437,0.015107167,-0.0803579465,-0.0564074665,-0.0575748049,-0.0424269475,-0.013087417,0.0583501756,0.0578656308,0.0112758931,0.0242137481,-0.000704706,0.0288715456,0.0297777597,-0.0469496027,-0.0834944174,-0.0022508204,0.010143863,-0.0804650411,0.0323880576,0.0506841391,0.0116241919,-0.0210350472,-0.027079992,0.0677436143,-0.075656876,-0.0675330907,-0.0595758818,-0.0331799537,0.0787065253,-0.0636389926,0.0209564772,-0.028116364,0.0705545247,0.0455328934,0.0167560484,0.0214764681,0.0661961436,0.0132886674,0.0769376904,0.0085646389,0.0063600047,0.0151530551,-0.0315136127,-0.0631191283,0.0404022187,0.0702968836,0.028801484,0.0046922602,-0.0847198144,0.0455099605,0.0693649501,0.0454043895],[0.0310695581,-0.0491276756,-0.0202974938,-0.0368706398,-0.01629466,0.0597514659,-0.0391497537,-0.0448133834,-0.0064692805,-0.0149152549,-0.0864368305,-0.0639849827,-0.0487967953,0.0429042801,-0.0536661446,-0.0775673091,-0.0514822155,0.0468922369,-0.0313492157,-0.0437686965,0.0250606705,0.0622296222,-0.0163452048,-0.0573623627,-0.0143833086,0.000911031,0.0066765556,0.0643470883,-0.0838970616,0.019490514,-0.0393753722,0.0607141703,0.0690770969,-0.0878417268,0.0229940061,-0.0188427977,-0.0318495817,0.0396483466,0.022465745,-0.0552428141,0.0246281866,-0.0339073986,-0.0334967747,-0.0868929699,-0.0557423681,0.0251198933,-0.0368642062,-0.0173734948,-0.0633103475,0.0455921069,-0.057119865,-0.0637669787,-0.0232331734,0.0356605798,-0.0467394963,-0.0668332353,0.0318003446,-0.0209670477,-0.0457442142,-0.0903846696,-0.025309531,-0.0555339903,-0.018083144,-0.0189961083,0.0669302642,-0.0647911355,-0.0389754772,0.074019976,0.0222279262,0.0082295667,0.0106043145,-0.0522933416,-0.0693421066,0.0060775559,0.070230931,0.0754629299,-0.0848336816,-0.0618878379,0.03085123,-0.0377690271,0.0044900402,-0.0210205708,0.0653668791,-0.0006810871,0.062503323,0.0012339962,-0.0797038749,-0.0623210818,0.071006082,-0.0459338427,-0.0255735498,-0.0108912317,0.0076737427,0.0252141915,0.027522359,0.0570165217,-0.0820793509,-0.0231322479,-0.0000261614,-0.0236061662,-0.0003740685,0.0200500246,0.0007237131,0.0423745103,0.0020739604,0.0125340708,0.0164131876,0.0645410642,-0.0783455372,-0.0477167517,0.0715345293,-0.0683973581,0.019119693,-0.0809268057,-0.0443157144,-0.0055360598,-0.0703258589,-0.0728773624,0.0742328539,-0.0253493916,-0.0190362334,-0.0468536206,0.0299462918,-0.0183119494,-0.0677625835,-0.0131679671,0.0230748225,0.001614674],[0.0283616465,-0.086349003,0.0637819394,0.0399270728,-0.019457655,-0.0534951538,-0.0326464064,-0.0279424079,-0.0212569069,-0.0936929211,-0.076511018,0.0372592621,-0.0652274713,0.0818156004,0.0380230509,0.0575143918,-0.005747457,0.0590402745,-0.0026226407,-0.0887696221,0.0014878752,-0.0198973324,-0.092591621,0.0752741098,-0.0813357905,0.0027898757,0.0706338584,-0.0333202928,0.0082080225,0.049152799,0.0681813508,0.0226207841,0.0586612821,0.0693679303,0.0081775784,0.0453749523,-0.0377033763,0.0865884051,-0.084818244,0.0260080379,0.0197615866,0.0149056874,-0.0643581599,0.0724876001,-0.0794299915,-0.0130599737,-0.0567547046,-0.0739244223,0.0090869246,0.005452455,-0.0103588235,-0.0455644429,0.0057978025,-0.0583461523,0.0180595182,-0.0368802734,0.0008461972,0.0170002766,-0.0120268902,-0.001693302,0.0350601375,0.0341852866,-0.0949517265,-0.0573109426,0.0766712278,0.0034765152,0.0353646688,0.0764283314,-0.0325321257,-0.0659024864,0.0845116675,0.0439558811,0.0676628277,0.0642734766,0.0345515236,0.0570063107,-0.0157336928,0.003427905,0.0600654483,-0.0347159244,-0.0015129388,0.0202759709,-0.0360382684,-0.091098167,0.017245302,-0.0024975447,0.0547865517,-0.0720726252,0.0649037734,-0.0601251125,0.0378681161,-0.0710221753,0.0166932251,0.0070158434,-0.0550272875,-0.0612725168,0.0267762933,0.0202080701,0.0534836911,0.0363456644,-0.047689084,0.0147130396,-0.0190620273,0.0291163083,0.0095394989,-0.0851393193,0.0736228153,-0.0414957181,-0.0452706516,0.0495298617,-0.0242275763,0.0073690056,0.0648132265,0.043870151,0.0557614341,-0.0873947665,0.0062386049,0.0281053241,-0.0744835958,0.0076439134,0.0776089802,0.0577217378,0.0205409061,-0.0536064543,0.0513903312,0.0796876252,0.0367324986,0.0324868634],[-0.0226810481,-0.0516723841,0.0913571119,0.0568293184,-0.0124842832,0.0857959837,0.0128372367,0.0497988425,0.07558842,0.0496614911,0.0734395608,0.0136821922,0.0114622004,0.0309280306,-0.0741022825,-0.0853999108,0.0521688908,-0.0280371793,0.0472017564,0.0626349822,0.0657743588,-0.0419755802,0.0760537535,-0.0050100433,-0.0367149971,0.0338772908,-0.0376616269,0.0290189087,0.0085336203,-0.0387276933,-0.0661561117,-0.0742966011,0.0811950937,-0.0160627533,-0.0507827215,-0.0666042566,0.0097579239,-0.0060752439,-0.0895578042,-0.0643040761,-0.0249071028,0.056326624,0.0766832232,-0.0424795784,-0.0526562855,0.0931345075,-0.0643272996,0.0599829368,0.0507645719,0.0004695207,-0.0161490869,0.0015195216,-0.0658871606,-0.0136559699,-0.0010186192,-0.0108088171,-0.0811723396,-0.0014908657,-0.0651323423,0.0545094386,-0.0007928309,-0.0170348752,-0.0019902901,0.0736457258,-0.0508273914,0.0704681426,0.0327276848,0.0915354267,0.0342758335,0.0310980808,-0.0519405156,0.0122611821,0.0487824827,-0.0704280213,0.0814486891,0.0042281924,0.0504993871,-0.0535938591,0.0377220921,-0.067757681,0.0315948874,0.0403152332,-0.0791196153,0.0396993794,0.0821209848,-0.036361441,0.0462826528,0.0644127205,-0.0288757607,0.0583420694,-0.0025635071,0.0758428648,-0.0011917304,0.0600971542,-0.0207297187,0.0898425505,-0.0548354536,-0.0305099916,-0.0553719252,0.0307610203,-0.0819238424,0.0263297688,0.0420771539,0.0662473887,-0.0503062755,-0.0660250634,0.0728037134,-0.0001947453,-0.0454157069,0.052494701,0.0209867302,-0.0257781241,-0.0273722745,-0.0672765002,0.0045972872,-0.0806009695,-0.074324511,-0.0320006795,0.0184757188,-0.0592763163,-0.0158191808,-0.0174542479,0.0523164198,-0.0539589375,0.0469621532,-0.0893927068,0.0074400981,0.0368106104],[-0.0174696203,-0.0830784217,-0.0179747008,-0.0728302225,0.0327027328,-0.0456876606,-0.0575273894,0.0315034278,0.021967927,0.0219735801,-0.0557653978,0.0579062179,0.0720476955,0.0364301503,-0.0069995755,-0.0828483477,0.0067463089,-0.0603315122,0.0834507644,0.0279694609,0.0404642858,-0.0422627553,0.0195958093,-0.0705779567,-0.0550307557,0.0526841506,0.0771214813,0.0148124397,0.0505413972,-0.0063216276,-0.0362365209,0.0232755635,-0.0794873387,0.0001798018,0.0521513894,-0.000665987,0.0148832602,0.0432262495,-0.0329642594,0.0825181678,-0.0743903518,-0.0361573622,-0.070487693,0.0075418525,0.0639548972,-0.0589131489,-0.0891954154,-0.0642701089,0.0458456688,0.0204655696,-0.0116311815,-0.0808097795,0.0718246028,0.0294832531,-0.013467079,-0.0791083872,-0.0777054504,0.0355614386,0.002414373,-0.0162300561,-0.0696851462,0.0350090973,-0.0701593533,-0.0373218246,-0.018558858,-0.0595383793,-0.0186953414,0.0927500203,-0.0278696138,-0.0903732255,0.0328114443,-0.060108766,0.0124560054,0.0812974945,-0.0115267728,0.0067272591,-0.0069537153,0.0885354877,0.0715832785,-0.0539168902,-0.0548716001,-0.0839906633,0.0525045395,0.0797294676,-0.0555596389,-0.0800776333,0.0656282231,-0.0288947709,-0.0746816695,-0.0163774174,-0.0368405581,-0.0177177135,0.0669197515,0.0092482679,0.0089171138,-0.038064789,-0.0386224948,-0.0261472221,-0.0253337212,-0.029279612,0.0017652625,-0.0108272377,-0.0527764894,0.0250347778,0.0424786583,0.0099471472,-0.0375057794,0.0266402029,0.0165799353,0.0067425319,-0.0387666635,0.0107324338,0.0689880848,-0.0060181543,0.0125634912,0.0635208189,0.0154917408,-0.0664089993,0.0641499087,-0.074336201,0.0228410903,0.0150308125,0.0713027194,-0.0617818683,-0.0926549509,-0.0577362366,0.0081925001,0.0699650645],[0.0242345873,-0.0398777239,0.0772195607,0.0105411382,0.0843561143,0.0480406135,-0.0931639597,0.0258681439,-0.0502065159,0.0609050952,-0.0629700199,-0.0788052231,0.0724756122,-0.0820582286,0.0514345095,-0.0310321953,-0.0465342849,-0.0248759948,0.0539299287,-0.077724345,0.0117897466,-0.0234343279,0.0083511733,0.0677096993,-0.0389677957,-0.0570880882,-0.0805477202,0.0392101295,-0.0448588692,-0.0038810875,0.0501285456,-0.0368909836,0.0104332212,0.0695962906,-0.0452806689,0.0692864805,-0.0750052631,0.0796750411,-0.0502541885,-0.0246289875,0.0186677966,0.0058459076,-0.0629449934,-0.0064595109,0.0222813413,-0.0148694301,-0.0729759112,0.0052627516,-0.0783283114,-0.0570328087,0.0034494591,0.0630347654,-0.037681859,-0.0704289824,0.0013791102,-0.071807459,0.0720772967,-0.0459878631,0.0677495077,-0.0265070908,0.0378787071,0.021581199,0.0246206019,0.0330602974,0.0425447598,0.0693741888,0.0760565624,0.0084521482,-0.0330475233,-0.0095456121,0.0470177904,-0.0385868289,0.0173053332,-0.009123601,0.0652988702,0.0705632493,-0.0332739502,0.0335803479,-0.0062137204,-0.0519865416,-0.0628573373,-0.0536972433,0.0471431911,-0.0782714188,-0.0423922502,0.043178454,0.0651766285,-0.0235420279,0.0727306828,0.07614135,-0.0751649886,0.041710604,-0.0273180921,0.084897913,-0.0282890331,-0.0624172352,0.0338441953,0.0020640544,-0.0253182836,0.0624164902,-0.0079452265,-0.0063198283,-0.0523161963,0.0554845221,0.0483491793,-0.0481626205,-0.0175260995,0.0117563568,0.026709592,-0.0246332735,0.0192128364,-0.0322205052,-0.0001945341,-0.0094178505,0.0375348553,-0.0638486817,0.0563550815,-0.0183271542,0.0147329429,-0.0062974449,-0.0962406546,-0.0600129105,-0.0174987633,0.0048264898,-0.006085665,0.0787411332,0.0119985621,0.0254224632],[-0.0700653121,-0.0247776192,-0.015768636,0.035796918,0.0218631979,0.0130777275,-0.0442441553,0.0336056873,-0.0528092533,0.0319472738,0.01007214,-0.0582606792,0.0736753643,-0.0155171547,-0.0605595298,0.0607871562,-0.0168842319,-0.0455413125,-0.0743106455,-0.0814598873,-0.0080703199,0.0088034552,0.011991078,0.0804741532,0.0815970227,0.0191240888,-0.0122623192,-0.0891699567,-0.063642554,0.010693673,-0.0547114983,0.0116254361,-0.0877922475,-0.0545361452,-0.0560062006,0.0228193067,0.0409317426,-0.0739681274,-0.0760740489,0.0812111124,0.0409307927,0.003904592,0.0595287345,-0.0500227399,-0.0305919945,-0.0566468053,0.0050172159,-0.0926562622,-0.0490604229,0.034617655,0.0273908544,-0.0955542773,0.02724245,-0.0295635164,-0.0317598954,0.0284933634,0.0542296544,-0.0688643456,0.0927731246,0.0707157776,-0.0112937102,0.055765029,0.0634349808,-0.0567252263,0.0162537564,-0.028863905,0.0409236513,-0.0315396003,0.0614087321,0.0523949452,0.0212266389,-0.021982329,-0.0212756358,0.0834714249,0.0683205277,0.0778654441,-0.0358188152,-0.0540615171,-0.0153830322,-0.072594285,-0.0816552714,0.0731516778,-0.0269487221,0.0139550744,0.0368582755,0.0327882804,0.0703937113,-0.0737038553,-0.0794696286,0.0032317778,-0.0376863107,-0.0148819797,0.075884141,-0.0017534099,0.0386237614,0.0191907883,0.0478949919,-0.0485937856,0.0800131634,-0.0437101163,-0.0023867004,0.0047758305,-0.051365491,-0.0853904858,-0.0475603268,-0.0422684401,-0.0408743694,-0.0902866125,-0.0129796173,-0.041918125,-0.0729479194,0.0343877524,-0.0709054023,0.0066375695,-0.0783198997,-0.0244281422,0.0301529039,0.0579772554,-0.0794691816,-0.0329047814,0.0407663137,-0.0825501904,0.0220944397,-0.0478091501,-0.014815825,0.0034248179,-0.0224270187,0.0685411841],[0.0024283223,0.0620385222,0.0861042887,-0.0871360302,-0.0021424475,-0.0104704304,0.0526626408,0.0345083401,0.0422946475,0.0179147273,0.0098367017,-0.0308984965,0.0016973224,0.040206261,-0.0273158923,-0.0113806091,0.0553104877,-0.0927602127,0.0322496295,0.0275327675,0.0077764299,-0.0954101756,-0.0273428336,0.0004586693,-0.0547294021,-0.0475600176,0.0743319094,-0.033426106,0.0532577597,0.0096667232,0.0712339878,0.001810701,0.0249273889,-0.0022575576,0.0509465858,0.0543255582,0.041923169,-0.0611334816,0.0341980346,-0.036056295,0.0120663214,0.0438749008,0.0534005351,-0.0250853114,-0.0126845296,0.0380375832,-0.0295413099,0.0008352214,0.0561438315,-0.0206673741,-0.0344078951,0.0343404822,-0.0701671094,-0.0668586269,-0.0913208053,0.0364687145,0.0564724877,-0.0868422836,0.0570836365,-0.0648294017,0.0185514931,0.0362378471,-0.0850278661,0.049629081,-0.063876763,-0.0205752756,0.0169121306,-0.0121041453,-0.0804321244,0.0522005297,0.0928439051,-0.0214143489,0.0308769811,-0.0317484252,-0.0103129316,-0.041104082,-0.0779062063,-0.0347958282,-0.0099720713,-0.0321250707,0.0478116423,-0.0665359497,0.0909208059,-0.0741697848,-0.0731313378,0.0099708959,-0.075274013,0.0791347846,-0.0511634536,-0.0466752946,0.0251637194,0.0464624651,0.0137610529,-0.0032363229,-0.023176102,-0.0215442553,0.0122030424,-0.0873977616,0.0661720857,-0.0593300276,-0.0956439823,-0.0441311933,0.0379423499,0.0051677339,0.0608846806,-0.0736562908,-0.0052967793,0.0578095317,-0.022886306,0.0057305642,-0.0664484277,0.0295000728,-0.0468128473,0.0777288824,0.0886318386,0.0253189355,0.0002490779,-0.0462463163,0.0602992438,-0.0378162861,0.0099575454,-0.0317099281,-0.0439775437,0.0658977702,-0.0197729412,0.039216768,-0.0604897626,0.0849694982],[-0.0440869965,0.0340686142,-0.0642591119,-0.0783023611,-0.0273847841,-0.0498009026,-0.0771529526,0.0315202586,-0.0360552333,0.0249584354,0.0771348402,-0.043180272,-0.048099149,0.0650960878,-0.0658611506,-0.0758440793,0.0480525345,0.0151487235,0.0587725975,-0.0777534172,-0.0635573789,-0.0467829704,-0.0235998929,-0.0807731897,0.0293327868,0.0623195469,-0.0794702321,-0.0311915688,-0.014505676,-0.0788014233,0.0624028295,0.082703799,0.0564342812,-0.0412504114,0.0702590123,0.0672104508,0.0549252667,0.0101824477,0.0654734522,-0.0546148717,0.0401486605,0.062106058,-0.078335844,0.0800285414,-0.0879878625,0.0270064548,0.0291532371,-0.094767876,-0.0280438848,-0.0131802196,-0.033202529,0.0034538042,0.058092393,-0.0364420153,0.0337488875,0.0320143849,-0.007481968,0.0433424823,-0.0193742774,0.0032967327,-0.0292682257,-0.0702828243,-0.0723033994,-0.0595292076,0.0005797264,-0.0180652048,-0.0571529865,0.0926680639,0.0355515145,0.0799830928,0.0678269714,0.0634211749,-0.0516065657,0.0451752581,0.0284756739,0.0717085078,0.010694446,0.047516413,-0.0678763911,0.0062091239,-0.0755881667,0.0064502615,-0.0324537829,0.0453910716,-0.0360942483,0.0331676044,0.0211479552,-0.0641634539,-0.0738533288,-0.0256005432,-0.0823296085,0.0162615981,-0.0300678667,0.0448728316,-0.0233710911,-0.0463798381,0.0255331509,-0.0850138217,0.0287285484,0.0270398799,0.0357338674,0.0470978059,0.0629983619,0.0679002851,-0.0029355944,-0.0279805791,-0.0361392424,-0.0408402421,-0.0260502286,0.0255862102,0.0569126792,0.0148629602,-0.0415460654,0.0723165423,-0.0440495312,-0.022631323,-0.0630772635,-0.0017668054,0.079220064,-0.063181296,-0.047041826,0.0096525783,-0.0786654875,-0.0226634257,-0.0708233416,0.0219429098,-0.0596499406,-0.0446394384],[-0.0413930416,-0.0650612637,0.0516352952,0.0799587443,-0.0521338321,0.0761562437,-0.0357269235,-0.0557697229,-0.0481791832,-0.0658625439,0.0224048998,-0.0081952522,0.0058391662,0.0233498141,-0.021583328,0.0695238411,0.0298870336,-0.0660052821,-0.0584805422,-0.0784052387,0.0539382137,0.0278825704,0.0516227037,0.0069992114,0.0004492012,0.0519123748,0.0145116234,-0.0181329008,0.0643550679,0.021258641,0.0621877871,0.0898417532,-0.0426122397,-0.0552801453,0.0073396554,0.0735702217,-0.0210779663,-0.0232503917,0.0156438891,0.0293295141,-0.0156503171,0.0411064737,0.0072007659,-0.0837851614,0.0174506605,0.0577427819,0.0008528736,0.0239720233,0.0066925087,-0.0414282121,-0.0064527141,0.0128403045,0.0445705876,-0.0202684626,-0.0812976584,0.067489624,-0.0470506549,-0.0042205574,0.0138009852,-0.0785273686,-0.0197797157,0.0280264262,-0.0331985541,0.0813772082,0.0036607226,-0.0422358327,0.0458627306,0.0339099839,0.0425329246,0.0292677153,0.0164515804,-0.0684056208,0.0698455647,0.0537012108,-0.0592823215,-0.0426447242,0.0048103267,-0.0426211394,0.0748077855,-0.0181394592,-0.0375692211,-0.0798489898,-0.0641531572,-0.0646347255,0.0443157107,0.0291634072,-0.0267114267,-0.0687017068,-0.075445883,0.0395661518,0.0597969703,-0.0780022964,0.0055478094,0.0900795236,-0.00227314,-0.0334676169,-0.056384258,-0.0740835816,-0.0227475781,0.0148873283,-0.0314007252,0.0776255876,0.0022828237,0.0387816317,-0.0265083965,-0.0457061641,-0.0156525746,0.0465759821,-0.0722550526,-0.0659652278,0.0508701093,0.0720475093,0.0100241983,0.0119069442,-0.0129301352,-0.0067692278,0.0619638748,-0.0589108802,-0.0086442167,0.0596931987,-0.0619866624,0.0459623747,0.066263102,0.0009853629,-0.0466956235,-0.0516596213,-0.0772109032,0.0870487317],[-0.014975844,-0.0735875368,0.0787476301,-0.093564257,0.0324534811,0.0369103029,0.0141030643,-0.0451308452,-0.0406023934,-0.0942438468,0.0028095117,0.0660706013,-0.083499983,0.0206867158,-0.076293245,-0.0141764479,0.0317151845,-0.0492172427,0.0365032591,-0.0553251281,0.0484897383,0.0072464682,-0.0837265328,-0.0006193624,0.0592193007,-0.0120418388,0.0758730322,0.0630862117,-0.0522331819,0.0270195045,0.0236415491,0.0933006108,-0.0136710685,0.0060948045,0.0316944756,-0.0504462384,0.090468429,-0.0429448187,-0.0149998069,0.0330843069,-0.0178025924,0.0261033736,-0.066236563,0.0455637984,0.0036069639,0.0414426848,0.0431057513,0.0703442171,0.0497432612,-0.0173902176,0.0682350397,0.0227872543,0.0722649321,-0.0095109651,-0.0818369687,-0.0282874256,0.0113125173,-0.0754908323,-0.0716457814,0.0448131338,-0.0786776319,0.0021155744,-0.0737059042,0.0846132487,-0.038670674,0.0719822496,0.0522824191,0.0877412185,0.082262516,0.0552196242,-0.0419884548,-0.0290028322,0.0060571786,-0.0772692636,-0.0549234636,0.030558629,-0.0522979796,-0.0102614881,-0.0071438141,0.0602829419,0.0146762365,0.0449830964,0.0174048096,0.0183525775,-0.0190700125,0.0213566069,0.0186053142,-0.0755591616,0.0456977226,-0.0345116407,-0.0775822625,-0.0614362545,-0.0618677363,-0.0489835292,0.0152516728,-0.0295018349,-0.0720115677,0.0572476909,0.0643457249,-0.0161154885,0.0208186749,0.0956025422,-0.06666255,0.0391435064,-0.0695622191,-0.0612412728,0.0787205175,0.0413267799,0.0073525039,0.0944788381,-0.0391669311,0.0531891733,0.0327429436,-0.0258922894,0.0826788396,0.018642487,0.0655522272,-0.0238248929,-0.0569728278,0.0856377408,-0.035497278,-0.0609938204,-0.0952790156,0.0505988039,-0.0664975867,-0.0000872463,0.0208507944,0.0761523768],[0.0652979836,-0.049580548,0.0120000467,-0.0912581459,0.0637242422,0.0307888966,0.030889336,0.0763877034,0.0601484105,0.0086515937,0.0367926583,0.0824532509,-0.0277371537,-0.0277311001,-0.0223406572,0.0002805134,0.0859482512,-0.0132391145,-0.0033404301,0.049303513,0.0070856418,-0.0673541874,-0.039736826,-0.0019307537,-0.0381070897,0.0551049486,0.0585077517,-0.0240875445,-0.058325652,0.0562817566,-0.0457645543,0.0198874772,0.00095766,0.069379136,0.0514496192,-0.0016553123,0.0508649684,0.0522416085,-0.0069395229,0.0119470423,-0.0333933532,0.0693230033,-0.0587844774,-0.0541556254,0.0792209581,-0.0750169158,0.011198136,-0.0914333388,0.0123151867,0.0196801294,0.0403588898,0.0652087107,-0.0539800227,0.0565169603,0.0084921811,-0.045777645,0.0589734986,0.0699538291,0.0798323601,0.0622461289,0.007958726,-0.0226944946,-0.0959602669,-0.0534306951,0.0273636077,0.0268450212,-0.0482290722,0.0594293065,0.0531247593,0.0302478652,-0.0623250753,-0.0576778576,-0.0380754247,0.0941246673,0.0076443474,-0.0057756039,-0.0324810743,0.0577701554,0.0521029346,-0.0393639356,-0.0216633584,0.0570082292,-0.0264837593,0.0417571701,-0.0662338883,0.0218565036,0.0681596845,0.0134375691,-0.0755606964,-0.0503205881,-0.0098562781,-0.0815843642,0.0578320697,0.057431709,0.0110793309,0.0524668247,-0.0012578446,-0.0458786115,0.0341044478,0.0280496664,-0.0425853617,-0.0650425404,-0.0513346568,-0.035406325,0.0125137232,-0.0794809535,-0.0004351868,0.0148797762,0.0364061296,0.0186797064,0.0319370069,-0.063522853,0.0618059635,0.0465631336,-0.0668076351,-0.0497817025,0.0377442837,-0.0112281982,-0.05108767,0.0683659986,-0.0808399692,-0.060229063,0.0263675414,-0.017114725,-0.0070640752,-0.0904748142,0.0242728926,0.0542848706],[-0.0123891812,-0.0234290268,0.0660216436,0.0278258361,0.0469010286,0.0769178271,-0.0216393489,-0.0626681,-0.0051582833,-0.0405403338,-0.0889732763,-0.0140443603,-0.0763675421,-0.0062037231,-0.0694087893,-0.0281126481,0.0609570742,0.0504831187,-0.0143607641,-0.0081550414,-0.0440157615,0.0679533854,0.0097709354,0.0165169258,0.0104839718,0.0110346591,0.0865322798,-0.0666520968,-0.0840880796,-0.0039939424,-0.0951208845,-0.0447108261,-0.0211907662,0.0711109638,-0.0709529221,-0.0355787612,-0.0189361777,0.0452607125,-0.0213141721,-0.0221309308,0.062092524,-0.0186880101,-0.0839071348,-0.0838817433,0.0100843702,-0.0157499015,0.0367058963,0.046961356,0.077590853,-0.0171866231,0.0666662604,-0.0875740051,-0.0371674076,0.056887567,-0.0262397118,0.0912843794,-0.0039942786,-0.012695279,-0.0481551997,-0.0752507374,-0.0144662997,-0.0466016643,-0.0661828071,0.048691947,0.0821977705,-0.0835949779,0.0628686324,-0.0726554841,-0.0818711147,-0.0868768245,0.0550621375,-0.0764610916,0.0680011287,0.0931007937,-0.0798280761,0.0889881626,-0.015373474,0.0065958002,0.028239511,0.0001398321,0.0137811014,-0.0330837592,0.0490391999,-0.0134009309,0.025399344,0.0375978053,-0.0764933452,0.0574146397,0.0700855032,0.0217917729,-0.0212484282,-0.0619894005,0.0786345378,0.0742830262,0.01748606,-0.0393976346,-0.0636538416,-0.0973485187,0.0486722551,0.0293338634,-0.0426732972,0.058040265,0.0680106506,0.0242713001,0.0143497707,-0.0648522079,0.0054428163,-0.0315705799,0.0214274339,-0.0088238865,-0.0610826872,-0.0812934116,-0.0571808182,-0.0003910332,-0.0609296001,0.0630359948,0.076677613,-0.0276656598,0.0293175876,-0.0281681512,0.0732776746,-0.064635016,-0.0392260626,-0.0796907321,-0.0844092667,-0.0292939581,-0.0384071283,0.0519173294],[-0.0389293097,0.0609340779,-0.0622199439,-0.039999526,0.0827195793,-0.0496131442,-0.0202167574,-0.0127624674,0.0430427901,-0.0630257875,-0.0415457375,0.0044685937,0.0221682806,-0.0573408231,-0.0773027092,-0.0456781499,-0.0253572576,0.0249218009,-0.0474188179,-0.0747243091,-0.0505142622,0.0673368052,-0.0435037464,0.0810842365,0.0635347962,-0.0256940965,-0.008778953,0.0542123653,-0.0473356619,0.0727433711,-0.0013085069,-0.0267728064,0.0268058516,-0.061444629,-0.0813319832,-0.0214500614,-0.0788047463,0.0935196653,-0.0234270226,0.0456252024,-0.0723654777,-0.0052552321,0.0194027852,-0.0031844364,-0.0384630859,-0.0361344665,0.0729111284,0.0742268339,0.0499137901,-0.0185695235,0.0082958089,0.006799751,0.0909672901,-0.0085092783,0.0067610126,-0.0748734325,0.0341470093,0.0274196845,-0.0008760198,0.0808632746,0.0537878275,-0.0359100625,-0.0709934309,0.0858857036,0.0521448031,0.0167348329,-0.0729111508,-0.023853112,0.0897258669,0.0677294657,-0.0035043349,0.0139009273,0.0176321082,-0.0465340801,-0.0848445296,-0.0109266471,0.0091046486,0.0854246765,0.0511513911,0.0241784975,0.071991086,0.0741210282,-0.0019228436,-0.0925856829,0.0601165928,-0.0493138134,0.0540493913,0.036394421,-0.0305656493,0.0572751015,-0.0538231358,0.0546308495,0.0020139073,0.0646677613,-0.0721747056,0.0125942808,0.0402932689,-0.0609418154,0.0209918302,0.057465151,-0.0147356745,0.0104754306,-0.0245616809,-0.057500191,0.0597270615,0.0039737187,-0.0376036018,-0.0650690272,0.0548002571,0.0796518847,0.0232839789,-0.0726427063,-0.0881067812,0.0522039793,0.06954588,0.0189310256,0.0675430074,-0.0001872078,0.0735616758,-0.0198301561,0.0465770811,0.0353772603,-0.0601528287,0.0025212697,0.0668925047,-0.0445850007,0.022060154,0.052513957],[0.069112666,0.0764570907,-0.0229136311,0.0169949234,-0.0652926341,0.0386926904,0.0282408502,0.0704918355,-0.0943760499,0.048823107,0.0623187758,-0.0535218306,-0.0662386715,0.083633393,0.0629170388,0.0371445604,-0.0590863898,-0.0265700854,0.046380017,0.065263845,0.0318739153,-0.0701894239,-0.002275229,-0.012688051,0.0383920521,0.0355046466,0.0626437813,0.0005952768,0.048086714,-0.0894094035,-0.0810901821,-0.0768777803,-0.067118071,-0.0936334357,0.0306311417,-0.0730683208,-0.0564253144,0.0925557539,-0.0794659629,-0.0822603181,-0.0501257256,0.0278940517,0.0498371013,0.0563731603,-0.0033420059,-0.067809619,0.0402859896,-0.0866233334,-0.0633997917,0.0601924285,-0.0271826331,-0.0542398617,-0.0620705411,-0.0609316416,-0.0228088684,-0.0167841427,-0.0081423223,0.0770368576,-0.0744600818,0.0777122006,0.0671330318,-0.028209012,-0.0677033961,0.0399750732,-0.0256186109,0.0086232657,0.0433851294,-0.0130288964,-0.0139110321,0.0598794185,0.0615061,0.0001638437,-0.070348911,-0.0070911623,-0.0146550275,0.0622198246,-0.0382535383,-0.0681790859,-0.0802173764,0.0049932417,0.0470263958,-0.0836637169,0.0033263357,-0.0951889232,-0.0204668399,0.091621384,-0.0512210205,0.0327696539,-0.0744895115,0.0524056405,-0.0315377116,-0.0046267631,-0.0306717884,-0.0000427871,0.0461178683,0.0406734347,-0.0469091274,-0.0184608269,0.0788860396,-0.0056408299,-0.0803191066,-0.0017779439,0.0371768177,-0.0881399661,-0.0468871668,-0.0572627634,-0.038566675,0.0586538427,-0.0155314459,0.0554348938,-0.0202915277,0.0106162131,0.0260076188,0.0183750503,-0.0692161992,-0.0168268234,-0.0201731864,0.0702524707,-0.0588426478,0.0539825223,0.0530934483,0.0379103236,-0.0502126962,-0.0032005445,0.0356508456,0.0781864077,0.0437517948,0.0708443671],[-0.0145154502,-0.0640452504,-0.0133757135,0.0611552522,-0.0687917471,0.0325980149,-0.0392668024,0.0447382145,-0.0290663745,-0.0242518187,-0.0705885068,-0.0256626755,-0.021088345,0.054943718,-0.0630346015,-0.0858206898,0.0814360008,-0.0139436107,0.037260484,0.0222091936,0.0567825921,-0.0446140282,0.0467982441,0.0573547706,0.0219633728,0.0219532605,-0.0137363961,0.0265117232,-0.0632550493,-0.0908359215,0.0517440289,0.0555187762,0.0383948758,-0.0742057189,0.0711647794,-0.0310076587,0.0926578566,0.0384442434,-0.0787759498,-0.037018314,-0.0719515383,-0.0406684503,-0.036813017,-0.048163224,0.019739598,-0.0245467387,-0.0051393169,-0.0154178012,-0.0744970739,0.0498360619,0.0888452679,-0.0072060153,0.0302341785,0.0330097079,0.0623871833,0.0794752091,0.0414267555,0.0457403027,0.0517934412,-0.0552230142,-0.0602912866,0.0766987428,0.0061385431,0.0109188138,0.0641100556,0.0085140625,-0.0681546554,-0.0094374502,0.0732750893,0.026899701,-0.038025327,-0.0274365116,0.0225837417,-0.0619366989,0.0611079223,0.091425918,-0.0405210853,-0.0199775007,0.0562311113,0.0687522143,0.06688191,-0.0352604613,0.0078996085,-0.0646675751,0.0214821268,0.0860853642,-0.0611337014,-0.021451097,-0.0185918659,0.0424874201,0.0667774454,-0.0310679171,-0.019289108,-0.0077331113,-0.0442126058,0.0896984264,-0.0687710643,0.0325959511,-0.0311310459,-0.0305068493,0.0247361716,0.0893428028,-0.0430480018,0.0254598483,0.0684200004,0.0524184369,-0.0437335335,0.0496207364,-0.0231188014,0.0160640776,0.0389711373,0.0282467529,0.0632083267,-0.0786287412,-0.0056067002,0.0756656528,-0.0496145263,-0.0072805192,-0.0024463895,-0.0025689574,0.0465784073,-0.058505144,-0.0546905696,0.0764262006,-0.0749389976,0.0092256544,-0.0108905397,0.046708189],[-0.0909934863,-0.0426146202,-0.0027871269,-0.0669066235,0.0178368241,-0.0759001449,-0.0461209379,-0.0744861588,0.0043614721,-0.0020655624,-0.0399315432,0.0307505392,0.0447608419,0.026909925,0.0313590877,-0.0786416382,-0.0659927875,-0.0137164202,-0.0473655649,0.049852591,0.0610002168,0.050487943,0.0060402434,0.0098080402,-0.0189729631,-0.0596358441,0.0715079159,0.0597968623,-0.0889863968,0.0614764057,-0.0853854343,-0.0615551472,0.066904895,-0.064341262,-0.0657790154,-0.0061450507,-0.0297644641,-0.0050548352,-0.0527354404,-0.0731970742,-0.004687747,0.0044145104,0.0389733948,0.0785147026,-0.0806163326,-0.0050541386,-0.0117237633,0.0662369058,0.0307791643,0.0478840396,0.0843361169,0.0277986005,0.012954196,-0.0381603204,-0.0021689211,0.0171695333,-0.0677027628,0.028835455,-0.06376791,-0.0300164483,-0.0562921688,0.0223216079,-0.0369730443,-0.0155674489,0.0741633624,-0.0355445109,0.0529655181,-0.0409286432,0.0795519501,0.0498620607,0.0807873011,-0.0333609134,-0.0838454068,-0.0725377575,0.0706425756,0.0320990272,-0.0255548004,-0.0501851402,-0.0555326454,-0.056068439,0.0795957744,-0.0859971344,0.0080201654,0.0554439798,-0.0158736557,-0.0165149774,-0.026404079,-0.0924817398,0.0181861967,0.0389625207,-0.0915554836,-0.0180734117,0.0300088059,0.0627154261,0.0302661546,-0.048635792,-0.0699400231,0.0567134954,0.0692537948,0.0069048842,0.0755057037,0.0560261346,-0.0285706595,-0.0571467616,0.0029716066,-0.024382567,-0.0664299428,0.0640480444,-0.0525946766,0.0578611903,-0.0313110128,-0.044970125,-0.041519586,-0.0335065238,0.0660759434,0.0721144676,-0.0345319211,0.0653471723,-0.0598244593,-0.0593056567,-0.0276529174,0.0036627194,0.0434226915,0.0321906097,-0.0922877043,0.0337629281,-0.0270211454,-0.0694938079],[0.0424728692,0.0045131426,-0.0010351513,0.0119793089,0.0671818331,0.0543605089,-0.0720831156,-0.0380790457,0.0621957295,-0.0436331071,-0.0676933751,-0.0514704362,0.0675186217,-0.0776944906,0.0273601878,0.0526140518,-0.0724306554,-0.0747361109,0.0739788264,-0.0309995599,0.0480200239,0.009755387,0.0640186965,-0.0575788729,0.0747467503,0.0539816841,0.0539020859,-0.065779902,-0.0351398215,-0.0810985789,-0.0579901747,-0.0449685752,-0.0559441447,0.0578246452,-0.0809717998,0.0479875281,-0.0590297692,0.0819178298,0.020482393,-0.0647812709,0.0449753553,-0.0728403777,-0.0000531851,-0.0730607286,0.0297797211,0.0159956012,0.0645026118,0.0533311702,0.01027021,0.0127555011,0.0581216179,-0.033026699,-0.0216063801,0.0630342886,-0.0138732996,0.0471348688,-0.0322776772,-0.0107046114,0.0935930014,0.0205285586,0.0044160523,0.0025870397,-0.0114203887,0.0927175432,0.0826858878,0.020588303,-0.0435424075,-0.0498487763,-0.030798709,0.0405131616,-0.0055456739,0.0620350875,0.0781234577,0.081529282,0.0496697649,0.026216289,-0.020912284,-0.0310428906,-0.0846959949,0.0604790263,0.0614450984,-0.0123591078,0.0603449494,-0.0859091133,0.0373793095,-0.0453480929,0.048979152,-0.0796688944,-0.0049593714,-0.0519929975,-0.0320109539,0.0496576466,-0.0256234501,0.0210731886,0.0787009075,-0.0724417791,-0.0754381642,-0.024080269,-0.045561906,0.0291388519,-0.0051384349,-0.0205930378,-0.0136398226,-0.0139088463,-0.0103932479,-0.0891220719,0.0076379273,0.0285467096,-0.081108734,-0.0229524113,-0.018383747,0.0498828441,0.0443224832,-0.0251994822,0.0027646904,-0.0861948878,-0.0931475386,-0.0478886068,-0.0246451646,-0.0224446058,0.034441188,0.0479439907,0.0516280606,0.0725219473,0.0231200196,-0.0295874216,0.0240262859,0.0614050478],[-0.0269230884,0.0390062332,-0.0702775493,0.0727759674,0.046429079,-0.073018305,-0.0900530815,-0.0559329316,0.0808010399,-0.0812806636,-0.0616963618,0.0234405622,0.0256996304,0.0421854481,-0.0283289421,0.0801025778,0.0229697358,-0.0584845133,0.0617453642,-0.0147682959,-0.0025894621,0.0083786678,0.0677249581,0.0514389202,-0.0424249731,-0.0911338776,0.0671302825,-0.0916884318,-0.0271322653,0.0494316444,0.0398078673,0.0643187091,-0.0861441121,0.0070350599,0.0552651957,-0.0615986213,0.0813552514,-0.0265965592,-0.0761907175,-0.03842986,0.0053564538,-0.0151952468,-0.0360847935,-0.0164186731,-0.0822192207,0.0154654989,-0.0796722248,-0.0261249654,-0.06526573,-0.041479256,0.0556152426,0.0325148068,0.0177365448,-0.0319665633,-0.0815722346,-0.0065947487,-0.0576086566,-0.0807091966,0.0459008664,-0.0731615871,0.0686978325,0.0772739872,0.0319582075,0.0377115756,0.0696898401,-0.078985557,0.0075849788,0.0611847229,0.0321626812,-0.0600819923,0.0124228001,0.01781849,-0.0177933834,-0.0034438286,-0.03766286,-0.0574377887,-0.0497460589,0.027425224,0.0318948142,-0.0509024262,0.018330032,0.0358304307,-0.0470232293,-0.0505575575,0.0695581734,0.0125586158,0.071803987,-0.0236645602,0.0524901785,0.0402401313,0.0416051634,0.0325601585,-0.0255356375,-0.0468507595,0.0753957406,-0.0510313623,0.043206729,-0.0742594376,0.0143197533,0.0645608455,0.0743553042,-0.0440742821,0.0316413417,0.0577859767,-0.0716683194,0.0338538401,0.08147306,-0.0379509628,0.0315857679,0.076125972,0.0021653397,0.0074215019,-0.0090807574,-0.0355513543,0.0093619172,0.0212545339,0.0477455556,0.0759723559,-0.0645112246,0.0410386883,-0.0789434984,-0.043644838,0.0558457375,-0.0342547484,0.0144686112,-0.0240529366,0.0073989858,-0.0421874672],[0.011241043,-0.0559252389,0.0410180837,-0.0255740136,0.0708056092,-0.058841981,-0.005488703,0.0770848393,0.0567900054,0.0563705862,0.0577841587,-0.0322574452,-0.0386355221,-0.072933659,-0.0226306338,0.0420281775,0.0727131441,0.058318492,-0.0159613155,-0.0117593575,0.0375900604,-0.0660307258,-0.0647515208,0.0537002906,0.0718878582,0.0004263781,0.015287444,-0.0220346581,0.0703481808,-0.0019718236,-0.014284241,0.0213723425,0.012751177,-0.0576968528,-0.0493755899,-0.0211782567,-0.0100250291,0.0371221229,-0.0569858961,-0.0305041503,-0.0397145003,-0.0091105578,0.05466244,-0.0478782132,0.0282007474,0.0134111801,-0.0779196173,-0.0396681204,-0.0014866467,-0.0404681265,0.0856118798,0.0338730924,-0.0784075782,-0.0161139108,0.0523043796,-0.0161642767,-0.0078879353,0.0665569156,-0.0106141632,-0.0554277003,0.0228670854,0.0339295082,0.0571629629,-0.0098603535,-0.0164029598,0.0130552724,-0.0273381788,0.0243803523,0.0754289776,-0.0700309947,0.0196286384,-0.0269393679,-0.085866645,0.0583683439,-0.0668053403,-0.0409786217,0.0789063573,0.0121652214,0.0387169831,0.0339548588,0.0282949228,-0.0674181134,0.0908839256,-0.0689010769,0.0219134856,0.0133108413,0.0197736807,-0.0225629099,0.0792518184,-0.072907865,0.0057945931,0.0546391048,-0.0163895357,-0.015985366,-0.0110072661,-0.0575958416,-0.0514206365,0.0216852967,-0.0775178149,-0.0820962712,0.0484090783,-0.0198637191,0.0285459515,-0.0455295742,-0.0804463252,-0.0789284334,-0.0037256817,-0.0890736505,0.0444148034,0.0565686934,0.0610205606,0.0412445068,0.0334583186,-0.0710475892,-0.0660721511,0.0432249568,0.0139012309,0.0182442144,-0.0810964108,0.0328585058,-0.031621974,-0.0348380357,-0.0607641339,-0.0695247054,-0.0741781294,-0.0798518509,0.0177228171,-0.0612014681],[-0.052004952,0.0117934486,-0.0066165775,-0.07649564,-0.0398651548,0.0209590569,-0.0333493464,-0.0503109954,-0.0648224056,-0.0208520703,-0.0404657461,0.015983589,-0.0648934171,-0.0203152299,0.0131849805,-0.0530851856,-0.0644093007,0.0192702077,-0.009422957,-0.0447157212,0.0328586325,0.0588165745,-0.0859217644,-0.0141457664,0.0644316897,0.0646879897,-0.0808280706,-0.0776994973,0.0384699069,0.0302473456,0.064779833,-0.0439240262,-0.0345329046,0.0061174538,-0.0730287731,-0.0876667872,-0.0591749214,0.0161996558,0.0108185187,-0.0838390812,-0.0928983241,-0.0088672582,0.0699762255,-0.0239474811,-0.0262959823,0.047650449,-0.0854380801,0.0633587316,-0.0054199151,-0.043834839,0.068298772,0.0391007327,0.0390115082,-0.0436236933,0.0378270671,0.0528694466,0.0606808513,-0.0137999244,0.0489991903,-0.0013836856,-0.0402197465,0.0005689373,0.0445759594,0.0792791843,0.0223970208,-0.0151990866,-0.0806613117,-0.0181507505,0.02757941,-0.0286957864,-0.0196477808,0.0908385962,-0.0756668001,0.0267949216,0.0619778372,-0.016983958,-0.0201692749,0.0644781888,0.0187610332,0.0951710343,-0.0609490313,0.0607725009,0.059115231,-0.0726691931,0.0213190261,-0.0118382145,-0.0219731852,-0.0546937101,0.049547676,0.0848852918,0.0185666997,-0.0100327758,0.0233106893,-0.063310042,-0.076394394,0.0650492162,-0.0634592026,-0.0606356487,-0.0893165097,0.0577593148,0.0381241627,0.0474684723,0.0325055122,0.0254682973,0.0031253116,0.0702335089,-0.0633497611,0.03694259,-0.0438191816,0.0011501278,0.0054096184,-0.0793615431,-0.0186917447,0.0747080892,-0.0249704681,-0.0249607842,-0.0513113141,-0.0320397988,-0.0915439352,-0.0051647886,-0.0281063262,0.0265945327,-0.0225744266,-0.0862492174,0.0380053632,0.0477071367,-0.0347406529,0.0567378104],[-0.0372421108,-0.0339672901,0.0042307666,-0.0522510596,0.0596322231,-0.0348766558,0.0515030175,-0.0364458375,-0.0372827686,-0.0529493168,-0.0591614768,0.0135767367,0.0722704679,0.0523825213,-0.0560416467,0.0784850419,-0.0655846968,-0.086335361,0.0733768493,-0.0257845633,0.0523989685,-0.0183043797,0.0026841694,-0.0088044396,0.0145787895,0.0504453853,-0.0308982302,0.0643043071,-0.0133991605,-0.0628566742,0.0099884802,0.0204868633,0.0020340309,0.0390328206,-0.0814482048,0.0811718404,0.0698721334,0.0925040618,0.0159718934,-0.0231615808,-0.0142336003,0.0777329355,0.0626073629,-0.0082835937,0.0186628625,0.0115444064,-0.0302717648,-0.0647462606,0.0416946299,0.054870788,-0.0487402864,0.0364684425,-0.0396490172,0.0626171753,-0.0848251656,0.0460521355,-0.008011207,-0.0246376358,0.0010039185,0.0464773998,0.0446578562,0.0625135228,-0.06688568,0.0644958839,-0.0600982755,0.0734941214,-0.0401438884,-0.0017698181,0.0622230805,-0.0791988671,0.0435188934,0.0616127737,-0.0329505689,0.0129150832,-0.0489283726,-0.0378887765,-0.0849996656,-0.0601898022,-0.0513143055,0.073583141,0.0016040405,-0.0270441193,0.011677579,0.0531408526,0.0664439499,-0.0780970752,-0.0068648332,0.0470456518,0.0501306094,0.0342989415,-0.0875586569,0.0793861672,0.0718868598,0.0807475522,0.0465461276,-0.0123753436,0.0027869784,0.0227236524,-0.043167945,0.0413767584,-0.061821036,0.0416218527,-0.0220319852,-0.0517486557,0.0546704456,0.0044967504,-0.0908182934,-0.0321773253,-0.0446202457,-0.0674544349,0.0591643006,-0.0281941313,-0.0228738673,-0.079539068,0.0065842378,-0.08549916,-0.0572640821,0.0678099468,-0.0371398143,-0.0179226846,0.0631119385,0.0466804616,0.0052621798,-0.0836207345,-0.0348232128,0.0520901196,-0.0113275461,-0.0325074568],[-0.0242224094,-0.0025639425,0.0043675816,-0.0779356584,-0.0736607015,0.0669251084,0.0150260273,0.0112288799,-0.0186476093,-0.0784580559,-0.0828541145,-0.0698560253,-0.082715936,-0.0117947999,-0.0040329024,0.0290918425,0.0815247819,0.0614693724,-0.0082770279,-0.0103691611,-0.0612445921,-0.0135528315,-0.0460109115,0.0496167168,-0.068601422,-0.0423615277,0.0322627351,0.0767105669,-0.0037504272,0.0358170047,0.0501169525,0.0575615168,0.0465523228,-0.0654168427,0.0918381736,-0.0321293026,0.0937784389,-0.0717506185,0.0476145633,0.037756294,-0.0031160032,0.0116712637,0.0649010539,0.0028572243,0.0279065426,0.0690711439,0.0418626517,0.0480796434,-0.075564988,-0.0087603414,-0.0704980344,0.0211253874,0.0576492473,0.0116073312,-0.08679609,0.0666692033,-0.0253426395,-0.029762771,-0.0743205696,0.036307238,0.0234869886,0.0355918817,-0.0253805406,-0.0807229802,0.0360593647,0.0143883713,-0.0875231847,0.0921086892,-0.0255589541,0.0257223118,-0.0677409396,-0.0453259423,-0.0825184137,-0.0406225733,-0.0819281787,-0.0413307697,-0.0004458109,0.0641863644,-0.0901736692,0.0480688475,-0.0017304585,0.0489198938,-0.0580367483,0.0505102165,0.030218184,0.0266682673,0.0395683385,0.0329801627,-0.0854755715,-0.0191045459,-0.0614394657,0.0707525238,-0.0267294813,0.0199158229,-0.029635733,-0.077860266,-0.0699842349,-0.0875421688,0.0749144033,0.0371677913,-0.0412415415,0.0620088167,-0.0838882849,-0.0542739481,-0.0694431141,-0.0612483583,0.0168922823,-0.0456621498,0.0301890913,0.0706911907,-0.0309452545,0.0510287732,-0.0730906203,0.0415102094,0.0208142344,0.0423099957,0.0352244228,0.0213575512,0.0765050724,-0.0344217867,-0.0327424519,0.0065199318,-0.0536229685,0.0215047486,-0.0592096634,0.0518437885,0.0702789277,-0.0333651155],[0.0187722463,0.0757516846,0.057715714,0.0795425698,0.0301796105,-0.058808811,0.0161185991,-0.0350280441,-0.0088009927,0.051608596,